YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
/*******************************************************************************
**                                                                            **
**  (C) 2022 HYUNDAI AUTOEVER Co., Ltd.                                       **
**  Confidential Proprietary Information. Distribution Limited.               **
**  Do Not Copy Without Prior Permission                                      **
**                                                                            **
**  SRC-MODULE:                                                   **
**                                                                            **
**  TARGET    : All                                                           **
**                                                                            **
**  PRODUCT   : BOOTLOADER                                                    **
**                                                                            **
**  PURPOSE   :          **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                             Revision History                               **
********************************************************************************
** Revision  Date          By           Description                           **
********************************************************************************
** 1.0.2     10-Jan-2024   JYS         CP44-3725                              **
** 1.0.0     31-Oct-2023   Autoever    Initial Version                        **
*******************************************************************************/

/*******************************************************************************
**                              Include Section                               **
*******************************************************************************/
/* polyspace-begin MISRA-C3:20.9 [Justified:Low] "Not a defect" */
#include "Fota_User_Callouts.h"

#ifndef FOTA_INTEGRATION_SINGLEMEM_PLATFORM

#include "Std_Types.h"
#include "Fota_Globals.h"
#include "Fota_PflsInterface.h" /* for S32k3 SecureBoot */
#include "Fota_Verify.h"
#include "Csm.h"
#include "Fota_Cfg.h"
#include "Fota_IntFunc.h"
#include "Fota.h"
#if (FOTA_STD_ON == FOTA_SF20_ENABLE)
#include "Fota_Decrypt.h"
#include "HKMC_SecureFlash2.h"
#if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))
#include "Crypto_Cfg.h"
#include "Crypto_Util.h"
#include "Crypto_ASRExtension.h"
#include "Hse_Ip.h"
#else
#include "Hsm_HostAPI.h"
#include "SecurityApp_SecureBoot.h"
#endif
#endif
#if HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)
#include "Mcu.h"
#include "Mcu_LLD.h"
#include "Mcu_MagicCarpet_LLD.h"
#endif

#include "Rte_Type.h"
#include "EcuM.h"
#include "Dcm.h"

#if ((HWRESOURCE_FAMILY(HWRESOURCE_CYT2BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT3BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT4BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT6BXX)))
#include "arm_ghs.h"
#endif

#if ( HWRESOURCE_FAMILY(HWRESOURCE_TC33X) || HWRESOURCE_FAMILY(HWRESOURCE_TC35X) || HWRESOURCE_FAMILY(HWRESOURCE_TC36X) || \
      HWRESOURCE_FAMILY(HWRESOURCE_TC37X) || HWRESOURCE_FAMILY(HWRESOURCE_TC38X) || HWRESOURCE_FAMILY(HWRESOURCE_TC39X) )
#include "Mem_76_Pfls_Cfg.h"
#include "Mem_76_Pfls_Regs.h"
#endif

/*******************************************************************************
**                             Macro Definition                               **
*******************************************************************************/
#if (FOTA_STD_ON == FOTA_SF20_ENABLE)
  #if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))
    #define HSE_TEST
    #define SEC_SF_PBKDF2_ENCRYPT_KEY                                           (CryptoConf_CryptoKey_PBKDF2_Encrypt_Key)                 /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_DECRYPT_KEY                                           (CryptoConf_CryptoKey_PBKDF2_Decrypt_Key)                 /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_SOURCE_KEY_PSK_OFFSET                                 (CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK0)             /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_EXTRACTED_KEY                                         (CryptoConf_CryptoKey_PBKDF2_ExtractedKey)                /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_EXTRACTED_ELEMENT										(CryptoConf_CryptoKeyElement_PBKDF2_ExtractedKey)         /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_TARGET_KEY                                            (CryptoConf_CryptoKey_PBKDF2_Target_Key)                  /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_TARGET_ELEMENT										(CryptoConf_CryptoKeyElement_PBKDF2_Target_Key)           /*Crypto_Cfh.h*/
    #define SEC_SF_PBKDF2_DECRYPT_AES_ECB                                       0U
    #define KEY_SIZE	16U

    typedef struct
    {
        uint32 IVT_header;       /**< @brief IVT header marker */
        uint32 bootCfgWord;      /**< @brief Boot Configuration Word */
        uint32 reserved1;        /**< @brief 4 bytes reserved */
        uint32 pAppImg_addr_0;   /**< @brief Application address for Boot Target 0 */
        uint32 reserved2;        /**< @brief 4 bytes reserved */
        uint32 pAppImg_addr_1;   /**< @brief Application address for Boot Target 1 */
        uint32 reserved3;        /**< @brief 4 bytes reserved */
        uint32 pAppImg_addr_2;   /**< @brief Application address for Boot Target 2 */
        uint32 reserved4;        /**< @brief 4 bytes reserved */
        uint32 LCCfgWord;        /**< @brief Life-Cycle configuration word */
        uint32 cyrstalOscConfig; /**< @brief DEBUG Config */
        uint32 pHSE;             /**< @brief pointer to HSE image */
        uint32 reserved5[45];    /**< @brief 192 bytes reserved */
        uint32 GMAC[7];          /**< @brief GMAC TAG over the IVT image */
    } ivt_t;
	#define FOTA_HSE_CORE0_ID  ((hseAppCore_t)0U)
	/* List of identifiers for the MU instances */
	#define FOTA_HSE_MU0_INSTANCE                     ((uint8)0U)
	/* Identifier of the MU channel used by HSE to listen for administrative requests */
	#define FOTA_HSE_MU_CHANNEL                       ((uint8)1U)
	#define BOOT_SEQ_SHIFT                            ((uint8)3U)
	#define BOOT_SEQ_ENABLE                           ((uint8)1U)
	#define BOOT_SEQ_MASK                             ((uint8)8U)

