YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
	typedef enum
	{
	  FOTA_SECURE_BOOT_MAC_GENERATE      = 0U,
	  FOTA_SECURE_BOOT_TAG_WRITE         = 1U,
	  FOTA_SECURE_BOOT_TAG_WRITE_CHK     = 2U,
	  FOTA_SECURE_BOOT_INSTALL_SMR       = 3U,
	  FOTA_SECURE_BOOT_IVT_ERASE         = 4U,
	  FOTA_SECURE_BOOT_IVT_ERASE_CHK     = 5U,
	  FOTA_SECURE_BOOT_IVT_WRITE         = 6U,
	  FOTA_SECURE_BOOT_IVT_WRITE_CHK     = 7U,
	  FOTA_SECURE_BOOT_END               = 8U
	} Fota_MacUpdateStat;

  #endif
#endif

#if ((FOTA_SOFTWARE_VERSION_CHECK == STD_ON) &&\
  (FOTA_MCU_MEMORY_ACCESS_TYPE == FOTA_SINGLE_TYPE))
typedef enum
{
  FOTA_VERSION_CHECK_CALLOUT_EQUAL = 0,
  FOTA_VERSION_CHECK_CALLOUT_SMALLER,
  FOTA_VERSION_CHECK_CALLOUT_GREATER
} Fota_VersionCompareCallOutType;
#endif
/*******************************************************************************
**                            Global Data Types                               **
*******************************************************************************/

/*******************************************************************************
**                              Global Data                                            **
*******************************************************************************/

const uint8 Fota_MetadataBlock_Length_64[4] =
{ 0x00, 0x00, 0x00, 0x40 };

const uint8 Fota_MetadataBlock_Length_32[1] =
{ 0x38 };

const uint8 Fota_MetadataBlock_Delimiter[4] =
{ 0x3B, 0x49, 0x0C, 0x30 };

const uint8 Sec_Gau8_Signature_Length[4] =
{ 0x00, 0x00, 0x01, 0x00 };

const uint8 Sec_Gau8_Asims_Delimiter[FBL_SIGN_ASIMS_DELIMITER_NUM][4] =
{
  /* aSIMS Delimiter */
  {0x3B, 0x49, 0x21, 0x1B},

  {0x3B, 0x49, 0x1B, 0x21},

  {0x3B, 0x49, 0x22, 0x2B},

  {0x3B, 0x49, 0x2B, 0x22},

  {0x3B, 0x49, 0x23, 0x3B},

  {0x3B, 0x49, 0x3B, 0x23},

  {0x3B, 0x49, 0x24, 0x4B},

  {0x3B, 0x49, 0x4B, 0x24}
};

const uint8 Sec_Gau8_Fst_Delimiter[FBL_SIGN_FST_DELIMITER_NUM][4] =
{
  /* FST Delimiter */
  {0x3B, 0x49, 0x31, 0x1C},

  {0x3B, 0x49, 0x1C, 0x31},

  {0x3B, 0x49, 0x32, 0x2C},

  {0x3B, 0x49, 0x2C, 0x32},

  {0x3B, 0x49, 0x33, 0x3C},

  {0x3B, 0x49, 0x3C, 0x33},

  {0x3B, 0x49, 0x34, 0x4C},

  {0x3B, 0x49, 0x4C, 0x34},

  {0x3B, 0x49, 0x35, 0x5C},

  {0x3B, 0x49, 0x5C, 0x35}
};

/* ASIMs public key*/
const uint8 Fota_Sec_Gau8_ImageServPubKeyAsims[SEC_RSA_PUBLIC_KEY_MODULUS_LENGTH + 4U] = {
  0xB4U, 0xD0U, 0x84U, 0xE9U, 0x8CU, 0x88U, 0x50U, 0x7CU, 0x20U, 0x01U, 0x18U, 0x37U, 0xD8U, 0x43U, 0xC0U, 0xE4U,
  0xE1U, 0x0AU, 0x99U, 0xC7U, 0x52U, 0x20U, 0x28U, 0x3FU, 0xABU, 0x74U, 0x74U, 0xCDU, 0x87U, 0xBAU, 0x84U, 0xBFU,
  0xC2U, 0xE7U, 0xADU, 0x2CU, 0xB4U, 0xCCU, 0xF0U, 0xC3U, 0xABU, 0x1EU, 0x5CU, 0xEAU, 0x14U, 0x45U, 0x6BU, 0x8CU,
  0xDCU, 0xE7U, 0xCEU, 0xA1U, 0x1EU, 0x36U, 0xD9U, 0xE7U, 0xFDU, 0xA4U, 0x1AU, 0xD4U, 0x16U, 0x82U, 0xD3U, 0x47U,
  0xE8U, 0x5EU, 0xDBU, 0x9BU, 0x6DU, 0x00U, 0xFDU, 0xC8U, 0x15U, 0x14U, 0xB3U, 0xE8U, 0xB4U, 0x7EU, 0xECU, 0x2CU,
  0xFEU, 0xB7U, 0xFDU, 0x9FU, 0x30U, 0xBCU, 0x22U, 0x80U, 0x63U, 0xC2U, 0x40U, 0x7FU, 0x55U, 0x34U, 0x4BU, 0x04U,
  0x65U, 0xFFU, 0xD2U, 0x53U, 0xEFU, 0x89U, 0xBEU, 0xE3U, 0x5CU, 0xCBU, 0xA8U, 0x54U, 0x34U, 0xD5U, 0xB5U, 0xAAU,
  0x92U, 0x9AU, 0xB9U, 0x22U, 0x2EU, 0x67U, 0x3AU, 0xF4U, 0x2AU, 0x7FU, 0x48U, 0xA8U, 0xE5U, 0x88U, 0x85U, 0x07U,
  0x16U, 0xC4U, 0x37U, 0x4DU, 0xC3U, 0x51U, 0x2FU, 0x65U, 0x29U, 0x39U, 0xCEU, 0x3CU, 0x7BU, 0x0BU, 0x8CU, 0xE5U,
  0x50U, 0x15U, 0x3EU, 0xAEU, 0xEFU, 0xA3U, 0x0BU, 0xCEU, 0x18U, 0xF8U, 0x00U, 0x20U, 0x35U, 0xC6U, 0x37U, 0x78U,
  0x2EU, 0xA7U, 0x5CU, 0xDAU, 0x79U, 0x80U, 0xB5U, 0xB8U, 0x09U, 0xDFU, 0x1EU, 0x0FU, 0x0FU, 0xE4U, 0xC4U, 0x62U,
  0xA0U, 0x4EU, 0x6CU, 0x33U, 0x1CU, 0x07U, 0x2EU, 0x18U, 0x06U, 0x6EU, 0xE6U, 0x9EU, 0x23U, 0x89U, 0xEDU, 0x7AU,
  0x23U, 0x4AU, 0xC4U, 0xA1U, 0xA3U, 0xF5U, 0x11U, 0xCAU, 0x5DU, 0x84U, 0x13U, 0x9FU, 0xC2U, 0x63U, 0xB9U, 0x14U,
  0xFCU, 0x75U, 0x58U, 0x51U, 0x52U, 0xEDU, 0x77U, 0xF7U, 0xE1U, 0x3FU, 0x69U, 0xC1U, 0x72U, 0xEBU, 0xF1U, 0xD3U,
  0x3EU, 0x57U, 0x51U, 0x91U, 0xBCU, 0x19U, 0x13U, 0xA5U, 0x89U, 0xBAU, 0x0CU, 0x81U, 0x14U, 0x45U, 0xFFU, 0x77U,
  0x32U, 0xE3U, 0x44U, 0xC4U, 0x3BU, 0xF5U, 0x50U, 0x4CU, 0x48U, 0xE7U, 0x7BU, 0xF8U, 0xB2U, 0xA6U, 0xB5U, 0x9BU,

  0x01, 0x00, 0x01, 0x00
};

/* User must changes this to use FST public key*/
const uint8 Fota_Sec_Gau8_ImageServPubKeyFst[SEC_RSA_PUBLIC_KEY_MODULUS_LENGTH+4U] = {
  0xD6U, 0xE5U, 0xA8U, 0xD3U, 0x44U, 0x70U, 0x98U, 0xD3U, 0x44U, 0xBEU, 0x8EU, 0x7AU, 0x60U, 0x4BU, 0x96U, 0x2FU,
  0x14U, 0x89U, 0x4EU, 0x59U, 0xEBU, 0xCCU, 0xA7U, 0xC6U, 0x1CU, 0x2CU, 0x2BU, 0x1AU, 0x3CU, 0x1FU, 0x8EU, 0xB2U,
  0xCCU, 0xD7U, 0x67U, 0x5EU, 0x6DU, 0xF2U, 0x3CU, 0x20U, 0x5FU, 0xC9U, 0x78U, 0x81U, 0xBAU, 0x61U, 0xECU, 0x93U,
  0x14U, 0x85U, 0xB1U, 0x5AU, 0x01U, 0x96U, 0x7AU, 0xF9U, 0xE2U, 0xECU, 0xDDU, 0xEAU, 0x61U, 0x95U, 0x0BU, 0xF2U,
  0xD9U, 0x89U, 0xBDU, 0x3AU, 0x63U, 0xBEU, 0x44U, 0x98U, 0xC4U, 0xEDU, 0xA4U, 0xB5U, 0x34U, 0xDBU, 0x97U, 0x10U,
  0x89U, 0x3DU, 0x8BU, 0xDFU, 0x99U, 0xF1U, 0x32U, 0x9FU, 0x64U, 0x88U, 0xC5U, 0xCDU, 0x08U, 0xA9U, 0xC4U, 0xBDU,
  0x66U, 0x51U, 0xFBU, 0x81U, 0x7FU, 0x8AU, 0xE3U, 0xABU, 0x6AU, 0x83U, 0x59U, 0x7EU, 0xDDU, 0x88U, 0x69U, 0x8EU,
  0x88U, 0xBFU, 0x9AU, 0xF8U, 0x64U, 0xABU, 0x7DU, 0xD7U, 0xA5U, 0x82U, 0xF3U, 0x1BU, 0x05U, 0xDBU, 0x36U, 0x0FU,
  0x5AU, 0x83U, 0x9AU, 0xD3U, 0x70U, 0xE2U, 0x5BU, 0x9EU, 0x5FU, 0xBFU, 0x6AU, 0xC4U, 0x11U, 0xE6U, 0x09U, 0x8AU,
  0x06U, 0xB1U, 0x63U, 0x22U, 0xCBU, 0xF1U, 0x50U, 0xA4U, 0xADU, 0x2FU, 0x97U, 0x97U, 0xC0U, 0xF7U, 0x5EU, 0x94U,
  0x48U, 0x39U, 0x41U, 0x54U, 0x92U, 0x92U, 0xA8U, 0xCFU, 0xABU, 0xEEU, 0xE4U, 0x12U, 0x8AU, 0xF8U, 0xB3U, 0x7FU,
  0x0DU, 0xE5U, 0xBDU, 0x27U, 0x69U, 0xF1U, 0xF4U, 0x8BU, 0xBBU, 0x87U, 0xB0U, 0x1FU, 0x0DU, 0xCDU, 0x00U, 0x24U,
  0x5AU, 0x6DU, 0x36U, 0xE2U, 0xD5U, 0xB9U, 0xDFU, 0x42U, 0x80U, 0x47U, 0x0EU, 0x34U, 0x89U, 0x27U, 0xDFU, 0xB6U,
  0x02U, 0xF6U, 0x1DU, 0xE0U, 0x94U, 0x4DU, 0xDAU, 0x2AU, 0x40U, 0x85U, 0xACU, 0x66U, 0xE7U, 0x38U, 0x8CU, 0x3CU,
  0x69U, 0xA0U, 0xA4U, 0x9AU, 0xFCU, 0x96U, 0x1BU, 0x65U, 0x2BU, 0xBAU, 0xC6U, 0x45U, 0x54U, 0x67U, 0x1EU, 0xB9U,
  0xB8U, 0xDBU, 0x01U, 0x66U, 0x75U, 0xA4U, 0xC8U, 0xFEU, 0x3AU, 0x1BU, 0x7AU, 0x35U, 0xEDU, 0xB4U, 0x72U, 0xDDU,

  0x01, 0x00, 0x01, 0x00
};

const uint16 Fota_Gau16_CRCA001_8[256] = {
  0x0000, 0xC0C1, 0xC181, 0x0140, 0xC301, 0x03C0, 0x0280, 0xC241,
  0xC601, 0x06C0, 0x0780, 0xC741, 0x0500, 0xC5C1, 0xC481, 0x0440,
  0xCC01, 0x0CC0, 0x0D80, 0xCD41, 0x0F00, 0xCFC1, 0xCE81, 0x0E40,
  0x0A00, 0xCAC1, 0xCB81, 0x0B40, 0xC901, 0x09C0, 0x0880, 0xC841,
  0xD801, 0x18C0, 0x1980, 0xD941, 0x1B00, 0xDBC1, 0xDA81, 0x1A40,
  0x1E00, 0xDEC1, 0xDF81, 0x1F40, 0xDD01, 0x1DC0, 0x1C80, 0xDC41,
  0x1400, 0xD4C1, 0xD581, 0x1540, 0xD701, 0x17C0, 0x1680, 0xD641,
  0xD201, 0x12C0, 0x1380, 0xD341, 0x1100, 0xD1C1, 0xD081, 0x1040,
  0xF001, 0x30C0, 0x3180, 0xF141, 0x3300, 0xF3C1, 0xF281, 0x3240,
  0x3600, 0xF6C1, 0xF781, 0x3740, 0xF501, 0x35C0, 0x3480, 0xF441,
  0x3C00, 0xFCC1, 0xFD81, 0x3D40, 0xFF01, 0x3FC0, 0x3E80, 0xFE41,
  0xFA01, 0x3AC0, 0x3B80, 0xFB41, 0x3900, 0xF9C1, 0xF881, 0x3840,
  0x2800, 0xE8C1, 0xE981, 0x2940, 0xEB01, 0x2BC0, 0x2A80, 0xEA41,
  0xEE01, 0x2EC0, 0x2F80, 0xEF41, 0x2D00, 0xEDC1, 0xEC81, 0x2C40,
  0xE401, 0x24C0, 0x2580, 0xE541, 0x2700, 0xE7C1, 0xE681, 0x2640,
  0x2200, 0xE2C1, 0xE381, 0x2340, 0xE101, 0x21C0, 0x2080, 0xE041,
  0xA001, 0x60C0, 0x6180, 0xA141, 0x6300, 0xA3C1, 0xA281, 0x6240,
  0x6600, 0xA6C1, 0xA781, 0x6740, 0xA501, 0x65C0, 0x6480, 0xA441,
  0x6C00, 0xACC1, 0xAD81, 0x6D40, 0xAF01, 0x6FC0, 0x6E80, 0xAE41,
  0xAA01, 0x6AC0, 0x6B80, 0xAB41, 0x6900, 0xA9C1, 0xA881, 0x6840,
  0x7800, 0xB8C1, 0xB981, 0x7940, 0xBB01, 0x7BC0, 0x7A80, 0xBA41,
  0xBE01, 0x7EC0, 0x7F80, 0xBF41, 0x7D00, 0xBDC1, 0xBC81, 0x7C40,
  0xB401, 0x74C0, 0x7580, 0xB541, 0x7700, 0xB7C1, 0xB681, 0x7640,
  0x7200, 0xB2C1, 0xB381, 0x7340, 0xB101, 0x71C0, 0x7080, 0xB041,
  0x5000, 0x90C1, 0x9181, 0x5140, 0x9301, 0x53C0, 0x5280, 0x9241,
  0x9601, 0x56C0, 0x5780, 0x9741, 0x5500, 0x95C1, 0x9481, 0x5440,
  0x9C01, 0x5CC0, 0x5D80, 0x9D41, 0x5F00, 0x9FC1, 0x9E81, 0x5E40,
  0x5A00, 0x9AC1, 0x9B81, 0x5B40, 0x9901, 0x59C0, 0x5880, 0x9841,
  0x8801, 0x48C0, 0x4980, 0x8941, 0x4B00, 0x8BC1, 0x8A81, 0x4A40,
  0x4E00, 0x8EC1, 0x8F81, 0x4F40, 0x8D01, 0x4DC0, 0x4C80, 0x8C41,
  0x4400, 0x84C1, 0x8581, 0x4540, 0x8701, 0x47C0, 0x4680, 0x8641,
  0x8201, 0x42C0, 0x4380, 0x8341, 0x4100, 0x81C1, 0x8081, 0x4040
};

#if (FOTA_STD_ON == FOTA_SF20_ENABLE)
  #if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))
    /* polyspace-begin MISRA-C3:8.9 [Justified:Low] "No Impact of this rule violation" */
    static uint8 test_flag;
    /* polyspace-end MISRA-C3:8.9 [Justified:Low] "No Impact of this rule violation" */

    static uint8 re_val[10]={0xFFu,0xFFu,0xFFu,0xFFu,0xFFu,0xFFu,0xFFu,0xFFu,0xFFu,0xFFu};

