YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
    static const uint8 FST_PSKKey[10][KEY_SIZE] =
    {
      {0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f},
      {0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x2b, 0x2c, 0x2d, 0x2e, 0x2f},
      {0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x3a, 0x3b, 0x3c, 0x3d, 0x3e, 0x3f},
      {0x40, 0x41, 0x42, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x4a, 0x4b, 0x4c, 0x4d, 0x4e, 0x4f},
      {0x50, 0x51, 0x52, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58, 0x59, 0x5a, 0x5b, 0x5c, 0x5d, 0x5e, 0x5f},

      {0x60, 0x61, 0x62, 0x63, 0x64, 0x65, 0x66, 0x67, 0x68, 0x69, 0x6a, 0x6b, 0x6c, 0x6d, 0x6e, 0x6f},
      {0x70, 0x71, 0x72, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78, 0x79, 0x7a, 0x7b, 0x7c, 0x7d, 0x7e, 0x7f},
      {0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8a, 0x8b, 0x8c, 0x8d, 0x8e, 0x8f},
      {0x90, 0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99, 0x9a, 0x9b, 0x9c, 0x9d, 0x9e, 0x9f},
      {0xA0, 0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6, 0xA7, 0xA8, 0xA9, 0xAa, 0xAb, 0xAc, 0xAd, 0xAe, 0xAf}
    };

    static const uint8 FST_PSKKey1[KEY_SIZE] =
    {
      0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f
    };

    static const uint8 AES_ECBKey[KEY_SIZE] =
    {
      0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f
    };

    static const uint8 Sha256_HMAC_Key[KEY_SIZE+KEY_SIZE] =
    {
      0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f,
      0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x2b, 0x2c, 0x2d, 0x2e, 0x2f
    };

	static hseSmrEntry_t smrEntry;
	static hseCrEntry_t crEntry;
	static ivt_t IVT;
	static hseSrvDescriptor_t	Fota_HseSrvDescriptor;
	static Hse_Ip_ReqType       Fota_HseIpRequest;
    static uint8 HmacTag[32];
    static uint8 Fota_IVTBuffer[8192];

  #endif
#endif

#if HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)
static VAR(boolean, AUTOMATIC) Fota_DestructiveResetEnable = FOTA_FALSE;
#endif

#if ((HWRESOURCE_MCU(HWRESOURCE_RH850F1K)) |\
     (HWRESOURCE_MCU(HWRESOURCE_RH850F1L)))
void WritetProtectRegister( uint32 *regadrr, uint32 value, uint32 *protadrr);
#endif
/*******************************************************************************
**                          Function Definitions                              **
*******************************************************************************/

#if (FOTA_STD_ON == FOTA_SF20_ENABLE)

  FUNC(Std_ReturnType, FOTA_CODE) Fota_DecryptStart_Callout
  (
    P2CONST(uint8, AUTOMATIC, FOTA_CODE) iv,
    P2CONST(uint8, AUTOMATIC, FOTA_CODE) firmwareKey,
    CONST(uint8, AUTOMATIC) firmwareKeyLen,
    P2CONST(uint8, AUTOMATIC, FOTA_CODE) macOfFirmwareKey,
    P2CONST(uint8, AUTOMATIC, FOTA_CODE) macKey,
    CONST(uint8, AUTOMATIC) macKeyLen
  )
  {
    Std_ReturnType retVal;

    if(RT_SUCCESS==SecureFlash_DecryptStart(iv, firmwareKey, \
                   firmwareKeyLen, macOfFirmwareKey, macKey, macKeyLen))
    {
		retVal=E_OK;
    }
	else
	{
		retVal=E_NOT_OK;
	}

    return retVal;
  }

  /* polyspace-begin MISRA-C3:8.13 [Justified:Low] "Not a defect" */
  FUNC(Std_ReturnType, FOTA_CODE) Fota_DecryptUpdate_Callout
  (
    P2VAR(uint8, AUTOMATIC, FOTA_CODE) output,
    P2CONST(uint8, AUTOMATIC, FOTA_CODE) input,
    CONST(uint32, AUTOMATIC) dataLen
  )
  /* polyspace-end MISRA-C3:8.13 [Justified:Low] "Not a defect" */
  {
    Std_ReturnType retVal;

    if(RT_SUCCESS==SecureFlash_DecryptUpdate(output, input, dataLen))
    {
		retVal=E_OK;
    }
	else
	{
		retVal=E_NOT_OK;
	}

    return retVal;
  }

  FUNC(Std_ReturnType, FOTA_CODE) Fota_DecryptFinish_Callout
  (
    P2VAR(uint32, AUTOMATIC, FOTA_CODE) totalLen
  )
  {
    Std_ReturnType retVal;

    if(RT_SUCCESS==SecureFlash_DecryptFinish(totalLen))
    {
		retVal=E_OK;
    }
	else
	{
		retVal=E_NOT_OK;
	}
    Fota_SecureFlashDecryptOn = FALSE;

    return retVal;
  }

  #if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))
    FUNC(void, FOTA_CODE) Fota_S32k3_Hse_Psk_injection(void)
    {
    #if 1
      if(test_flag == 9)
      {
        (void)Crypto_Exts_FormatKeyCatalogs();  /* initial KeyCatalogs(RAM/NvM) */
        test_flag = 0;

        re_val[0] = Csm_KeyElementSet(\
          CryptoConf_CryptoKey_PBKDF2_Encrypt_Key,\
          CryptoConf_CryptoKeyElement_PBKDF2_Encrypt_Key,\
          AES_ECBKey,\
          KEY_SIZE);

        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Encrypt_Key);

        re_val[0] |= Csm_KeyElementSet(\
          CryptoConf_CryptoKey_PBKDF2_Decrypt_Key,\
          CryptoConf_CryptoKeyElement_PBKDF2_Decrypt_Key,\
          AES_ECBKey,\
          KEY_SIZE);

        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Decrypt_Key);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK0,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK0,\
            &FST_PSKKey[0][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK0);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK1,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK1,\
            &FST_PSKKey[1][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK1);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK2,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK2,\
            &FST_PSKKey[2][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK2);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK3,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK3,\
            &FST_PSKKey[3][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK3);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK4,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK4,\
            &FST_PSKKey[4][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK4);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK5,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK5,\
            &FST_PSKKey[5][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK5);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK6,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK6,\
            &FST_PSKKey[6][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK6);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK7,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK7,\
            &FST_PSKKey[7][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK7);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK8,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK8,\
            &FST_PSKKey[8][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK8);

        re_val[0] |= Csm_KeyElementSet(\
            CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK9,\
            CryptoConf_CryptoKeyElement_PBKDF2_Source_Key_PSK9,\
            &FST_PSKKey[9][0],\
            KEY_SIZE);
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_PBKDF2_Source_Key_PSK9);

        /* for Secure Boot */
        re_val[0] = Csm_KeyElementSet(\
          CryptoConf_CryptoKey_MacGen_Sha256_HMAC_key,\
          CryptoConf_CryptoKeyElement_MacGen_Sha256_HMAC_key,\
          Sha256_HMAC_Key,\
          KEY_SIZE+KEY_SIZE);

