YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_MacGen_Sha256_HMAC_key);

        re_val[0] = Csm_KeyElementSet(\
          CryptoConf_CryptoKey_MacVer_Sha256_HMAC_key,\
          CryptoConf_CryptoKeyElement_MacVer_Sha256_HMAC_key,\
          Sha256_HMAC_Key,\
          KEY_SIZE+KEY_SIZE);

        re_val[0] |= Csm_KeySetValid(CryptoConf_CryptoKey_MacVer_Sha256_HMAC_key);
      }
    #endif
    }

#if 0 /* example */
    FUNC(Std_ReturnType, FOTA_CODE) Fota_S32k3_SecureBootEnable(void)
    {
	  VAR(Std_ReturnType, AUTOMATIC) retVal;
	  VAR(uint32,AUTOMATIC)         ElementIndex = 0; /* Temparary value for Crypto Defect */
	  VAR(uint8,AUTOMATIC)          EcuSwUnitIdx;
	  Crypto_VerifyResultType       verifyPtr;
	  hseMacScheme_t                macScheme;
	  hseMacSrv_t                   *pMacSrv;
	  hseSmrVerifySrv_t		        *pSmrVerifySrv;
	  hseSmrEntryInstallSrv_t       *pSmrEntryInstall;
	  hseCrEntryInstallSrv_t	    *pCrEntryInstallSrv;
	  hseAttrSmrCoreStatus_t	    smrCoreStatus_Get;
	  hseSrvResponse_t              hseRequestResult;
	  VAR(uint32,AUTOMATIC)         HmacTagLength=32UL;

	  retVal = E_NOT_OK;

	  EcuSwUnitIdx=Fota_FindSoftwareArea(FOTA_FBL_TYPE);
	  if (FOTA_INVALID_INDEX != EcuSwUnitIdx)
	  {
	    /* Steps for configuring secure boot is as followed. */
	    /* 1)copy IVT of length 256B from BLOCK0 section to data flash section */
	    FOTA_MEMCPY((void *)&IVT,
	    			(const void *)Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress,
	    			sizeof(ivt_t));

		if(BOOT_SEQ_ENABLE!=((IVT.bootCfgWord >> BOOT_SEQ_SHIFT) & BOOT_SEQ_ENABLE))
		{
		  (void)Csm_KeySetValid(CryptoConf_CryptoKey_MacVer_Sha256_HMAC_key);
		  /* polyspace-begin DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */
		  ElementIndex = Crypto_Util_GetKeyElementIdx (Crypto_Util_GetKeyIdx(CryptoConf_CryptoKey_MacVer_Sha256_HMAC_key), CryptoConf_CryptoKeyElement_MacVer_Sha256_HMAC_key);
		  *Crypto_aKeyElementList[ElementIndex].pu32CryptoElementActualSize = 32U;
		  /* polyspace-end DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */

		  (void)Fota_GetMemInstanceBySwUnit(EcuSwUnitIdx, &Fota_MemoryInstance);
		  (void)Fota_PflsGetFlashAlignment(Fota_MemoryInstance, &Fota_PflsWriteAlignmentValue);
		  Fota_PflsGetSectorSize(Fota_MemoryInstance, &Fota_PflsEraseAlignmentValue, Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress);

	      /*
	       * 2)copy start address of app from IVT in local variable.
	       *	 In case of SHE secure boot, SMR#0 shall be configured so app address
	       *	 is copied in local variable.
	       */
	      smrEntry.pSmrSrc = IVT.pAppImg_addr_0;              /* Start of APP code, pointing to active partition */
	      smrEntry.smrSize = 0x4FC00UL;                       /* 0x44FFFF(End) - 0x400000(Start) - 0x100(IVT) - 0x300(Tag) + 1 */
	      smrEntry.authKeyHandle = Crypto_aKeyElementList[ElementIndex].u32HseKeyHandle;
	      smrEntry.authScheme.macScheme.macAlgo = HSE_MAC_ALGO_HMAC;
	      smrEntry.authScheme.macScheme.sch.hmac.hashAlgo = HSE_HASH_ALGO_SHA2_256;
	      smrEntry.pInstAuthTag[0] = Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress + sizeof(ivt_t);      /* signature tag address, pointing to active partition */
	      smrEntry.pInstAuthTag[1] = (uint32)NULL;            /* In this example, AES keys is used hence 2nd tag address is NULL */

	      /* 3)Configure CR entry */
	      crEntry.coreId = FOTA_HSE_CORE0_ID;                 /* Define the behavior for core 0 - M33_0, core 1 - M33_1 */
	      crEntry.preBootSmrMap = (uint32)FOTA_TRUE;          /* Tie it to the verification of SMR defined above (index 0) */
	      crEntry.pPassReset = IVT.pAppImg_addr_0;            /* Entry point - address of the first instruction */
	      crEntry.crSanction = HSE_CR_SANCTION_DIS_ALL_KEYS;  /* Sanction in case SMR verification fails - keep core in reset */
	      crEntry.altPreBootSmrMap = 0x0UL;                   /* Not used here - configuration in case boot fails */
	      crEntry.pAltReset = IVT.pAppImg_addr_0;             /* Alternate Reset should not be NULL or 0xFFFFFFFF */
	      crEntry.startOption = HSE_CR_AUTO_START;

	      /* Sync */
	      Fota_HseIpRequest.eReqType   = HSE_IP_REQTYPE_SYNC;
	      Fota_HseIpRequest.u32Timeout = 5000000U; //for HSE_IP_REQTYPE_SYNC

		  /*
		   * 4) Generate and verify the tag so as to confirm
		   * that application is verified for secure boot
		   */
		  (void)Csm_KeySetValid(CryptoConf_CryptoKey_MacGen_Sha256_HMAC_key);
		  /* polyspace-begin DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */
		  ElementIndex = Crypto_Util_GetKeyElementIdx (Crypto_Util_GetKeyIdx(CryptoConf_CryptoKey_MacGen_Sha256_HMAC_key), CryptoConf_CryptoKeyElement_MacGen_Sha256_HMAC_key);
		  *Crypto_aKeyElementList[ElementIndex].pu32CryptoElementActualSize = 32U;
		  /* polyspace-end DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */

		  macScheme.macAlgo = HSE_MAC_ALGO_HMAC;
		  macScheme.sch.hmac.hashAlgo = HSE_HASH_ALGO_SHA2_256;
		  /* Fill the descriptor for the HSE request */
		  FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
		  Fota_HseSrvDescriptor.srvId  = HSE_SRV_ID_MAC;
		  pMacSrv = &(Fota_HseSrvDescriptor.hseSrv.macReq);

		  pMacSrv->accessMode = HSE_ACCESS_MODE_ONE_PASS;
		  pMacSrv->streamId = 0u;
		  pMacSrv->macScheme = macScheme;
		  pMacSrv->authDir = HSE_AUTH_DIR_GENERATE;
		  pMacSrv->keyHandle = Crypto_aKeyElementList[ElementIndex].u32HseKeyHandle;
		  pMacSrv->inputLength = smrEntry.smrSize;
		  pMacSrv->pInput = (HOST_ADDR)IVT.pAppImg_addr_0;
		  pMacSrv->pTagLength = (HOST_ADDR)&HmacTagLength;
		  pMacSrv->pTag = (HOST_ADDR)HmacTag;
		  pMacSrv->sgtOption = HSE_SGT_OPTION_NONE;

		  hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
                                                   &Fota_HseIpRequest, &Fota_HseSrvDescriptor);

		  if(HSE_SRV_RSP_OK != hseRequestResult)
		  {
		    retVal|=E_NOT_OK;
		  }

		  macScheme.macAlgo = HSE_MAC_ALGO_HMAC;
		  macScheme.sch.hmac.hashAlgo = HSE_HASH_ALGO_SHA2_256;
		  /* Fill the descriptor for the HSE request */
		  FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
		  Fota_HseSrvDescriptor.srvId  = HSE_SRV_ID_MAC;
		  pMacSrv = &(Fota_HseSrvDescriptor.hseSrv.macReq);

		  pMacSrv->accessMode = HSE_ACCESS_MODE_ONE_PASS;
		  pMacSrv->streamId = 0u;
		  pMacSrv->macScheme = macScheme;
		  pMacSrv->authDir = HSE_AUTH_DIR_VERIFY;
		  pMacSrv->keyHandle = smrEntry.authKeyHandle;
		  pMacSrv->inputLength = smrEntry.smrSize;
		  pMacSrv->pInput = (HOST_ADDR)IVT.pAppImg_addr_0;
		  pMacSrv->pTagLength = (HOST_ADDR)&HmacTagLength;
		  pMacSrv->pTag = (HOST_ADDR)smrEntry.pInstAuthTag[0];
		  pMacSrv->sgtOption = HSE_SGT_OPTION_NONE;

		  hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
                                                   &Fota_HseIpRequest, &Fota_HseSrvDescriptor);

		  if(HSE_SRV_RSP_OK != hseRequestResult)
		  {
		    retVal|=E_NOT_OK;
		  }

		  /* Tag Flash */
		  retVal|=Fota_PflsWriteRequest(Fota_MemoryInstance, \
                                        smrEntry.pInstAuthTag[0], \
                                        HmacTag, \
                                        HmacTagLength);
		  do
		  {
		  }while(MEM_JOB_PENDING==Fota_PflsGetJobResult(Fota_MemoryInstance));

