YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
          /* 5) Finally, install SMR and CR entry and verify SMR install */
          /* Clear the service descriptor placed in shared memory */
		  FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
          pSmrEntryInstall = &(Fota_HseSrvDescriptor.hseSrv.smrEntryInstallReq);

          /* Fill the service descriptor */
          Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_SMR_ENTRY_INSTALL;
          pSmrEntryInstall->accessMode = HSE_ACCESS_MODE_ONE_PASS;
          pSmrEntryInstall->entryIndex = 0u;
          pSmrEntryInstall->pSmrEntry = (HOST_ADDR)&smrEntry;

          pSmrEntryInstall->pSmrData = (HOST_ADDR)IVT.pAppImg_addr_0;           /* pointing to active partition */
          pSmrEntryInstall->smrDataLength = smrEntry.smrSize;
          pSmrEntryInstall->pAuthTag[0] = (HOST_ADDR)smrEntry.pInstAuthTag[0];  /* pointing to passive partition */
          pSmrEntryInstall->pAuthTag[1] = (HOST_ADDR)smrEntry.pInstAuthTag[1];  /* pointing to passive partition */
          pSmrEntryInstall->authTagLength[0] = HmacTagLength;
          pSmrEntryInstall->authTagLength[1] = HmacTagLength;

		  hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
                                                 &Fota_HseIpRequest, &Fota_HseSrvDescriptor);

		  if(HSE_SRV_RSP_OK != hseRequestResult)
		  {
		    retVal|=E_NOT_OK;
		  }

		  /* verify SMR entry - SMR verify is not allowed for SHE boot,
		     only on next cycle could it be verified if BOOT_SEQ=0 */
		  FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
		  pSmrVerifySrv = &(Fota_HseSrvDescriptor.hseSrv.smrVerifyReq);

		  Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_SMR_VERIFY;
		  pSmrVerifySrv->entryIndex = 0u;

		  hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
                                                   &Fota_HseIpRequest, &Fota_HseSrvDescriptor);

		  if(HSE_SRV_RSP_OK != hseRequestResult)
		  {
		    retVal|=E_NOT_OK;
		  }

		  /* Install CR Entry */
		  /* Clear the service descriptor placed in shared memory */
		  FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
          pCrEntryInstallSrv = &(Fota_HseSrvDescriptor.hseSrv.smrEntryInstallReq);

		  /* Fill the service descriptor */
		  Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_CORE_RESET_ENTRY_INSTALL;
		  pCrEntryInstallSrv->crEntryIndex = 0u;
		  pCrEntryInstallSrv->pCrEntry = (HOST_ADDR)&crEntry;

		  hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
                                                 &Fota_HseIpRequest, &Fota_HseSrvDescriptor);

		  if(HSE_SRV_RSP_OK != hseRequestResult)
		  {
		    retVal|=E_NOT_OK;
		  }

		  /* verify if secure boot is success */
		  FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));

		  Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_GET_ATTR;
		  Fota_HseSrvDescriptor.hseSrv.getAttrReq.attrId = HSE_SMR_CORE_BOOT_STATUS_ATTR_ID;
		  Fota_HseSrvDescriptor.hseSrv.getAttrReq.attrLen = sizeof(hseAttrSmrCoreStatus_t);
		  Fota_HseSrvDescriptor.hseSrv.getAttrReq.pAttr = (HOST_ADDR)&smrCoreStatus_Get;

		  hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
                                                 &Fota_HseIpRequest, &Fota_HseSrvDescriptor);

		  if(HSE_SRV_RSP_OK != hseRequestResult)
		  {
		    retVal|=E_NOT_OK;
		  }
	    }

		if(HSE_SRV_RSP_OK == hseRequestResult)
		{
		  retVal=E_OK;

		  /* BOOT_SEQ Enable */
	      FOTA_MEMCPY((void *)Fota_IVTBuffer,
                      (const void *)Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress,
                      Fota_PflsEraseAlignmentValue);

		  /* IVT area erase */
		  retVal|=Fota_PflsEraseRequest(Fota_MemoryInstance, \
                                        Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress, \
                                        Fota_PflsEraseAlignmentValue);
		  do
		  {
		  }while(MEM_JOB_PENDING==Fota_PflsGetJobResult(Fota_MemoryInstance));

		  Fota_IVTBuffer[FOTA_FOUR] |= BOOT_SEQ_MASK; /* 4~7: Boot configuration word */

		  retVal|=Fota_PflsWriteRequest(Fota_MemoryInstance, \
                                        Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress, \
                                        Fota_IVTBuffer, \
                                        Fota_PflsEraseAlignmentValue);
		  do
		  {
		  }while(MEM_JOB_PENDING==Fota_PflsGetJobResult(Fota_MemoryInstance));

          #if(FOTA_MCU_MEMORY_ACCESS_TYPE==FOTA_MMU_TYPE) /* MMU TYPE */
		  /* passive partition BOOT_SEQ Enable */
          (void)Fota_PflsTgtAreaSet(Fota_MemoryInstance,FOTA_ALT_ADDR);

		  /* IVT area erase */
		  retVal|=Fota_PflsEraseRequest(Fota_MemoryInstance, \
                                        Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress, \
                                        Fota_PflsEraseAlignmentValue);
		  do
		  {
		  }while(MEM_JOB_PENDING==Fota_PflsGetJobResult(Fota_MemoryInstance));

		  retVal|=Fota_PflsWriteRequest(Fota_MemoryInstance, \
                                        Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress, \
                                        Fota_IVTBuffer, \
                                        Fota_PflsEraseAlignmentValue);
		  do
		  {
		  }while(MEM_JOB_PENDING==Fota_PflsGetJobResult(Fota_MemoryInstance));
          #endif
		}
	  }

	  return retVal;
    }
#endif

    FUNC(Fota_JobResultType_CallOut, FOTA_CODE) Fota_S32k3_SecureBootProcess(void)
    {
	  Fota_JobResultType_CallOut secureBootProcessResult=FOTA_JOB_FAILED_CALL_OUT;
	  VAR(Fota_JobResultType_CallOut, AUTOMATIC) memJobResult;
	  static Fota_MacUpdateStat macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
	  VAR(Std_ReturnType, AUTOMATIC) retVal=E_OK;
	  VAR(uint32,AUTOMATIC)         ElementIndex = 0; /* Temparary value for Crypto Defect */
	  static VAR(uint8,AUTOMATIC)   EcuSwUnitIdx;
	  static VAR(uint32,AUTOMATIC)  TgtAreaAddr;
	  VAR(uint32,AUTOMATIC)         TgtAreaSize;
	  static VAR(uint32,AUTOMATIC)  SignatureTagAddr;
	  VAR(uint32,AUTOMATIC)         SignatureTagSize;
	  VAR(uint32,AUTOMATIC)         TgtStartAddr;
	  VAR(uint32,AUTOMATIC)         TgtStartSize;
	  hseMacScheme_t                macScheme;
	  hseMacSrv_t                   *pMacSrv;
	  hseSmrVerifySrv_t		        *pSmrVerifySrv;
	  hseSmrEntryInstallSrv_t       *pSmrEntryInstall;
	  hseCrEntryInstallSrv_t	    *pCrEntryInstallSrv;
	  hseAttrSmrCoreStatus_t	    smrCoreStatus_Get;
	  hseSrvResponse_t              hseRequestResult;
	  VAR(uint32,AUTOMATIC)         HmacTagLength=32UL;

	  /* polyspace-begin CERT-C:INT36-C, MISRA-C3:10.5,11.4 [Justified:Low] "No Impact of this rule violation" */
	  EcuSwUnitIdx=Fota_FindSoftwareArea(FOTA_FBL_TYPE);
	  if (FOTA_INVALID_INDEX != EcuSwUnitIdx)
	  {
	    switch(macUpdateStat)
	    {
		  case FOTA_SECURE_BOOT_MAC_GENERATE:
		    /* Steps for configuring secure boot is as followed. */
		    /* 1)copy IVT of length 256B from BLOCK0 section to data flash section */
		    FOTA_MEMCPY((void *)&IVT,
		    			(const void *)Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress,
		    			sizeof(ivt_t));

			if(BOOT_SEQ_ENABLE==((IVT.bootCfgWord >> BOOT_SEQ_SHIFT) & BOOT_SEQ_ENABLE))
			{
			  (void)Csm_KeySetValid(CryptoConf_CryptoKey_MacVer_Sha256_HMAC_key);
			  /* polyspace-begin DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */
			  ElementIndex = Crypto_Util_GetKeyElementIdx (Crypto_Util_GetKeyIdx(CryptoConf_CryptoKey_MacVer_Sha256_HMAC_key), CryptoConf_CryptoKeyElement_MacVer_Sha256_HMAC_key);
			  *Crypto_aKeyElementList[ElementIndex].pu32CryptoElementActualSize = 32U;
			  /* polyspace-end DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */

