YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
	        /* 5) Finally, install SMR and CR entry and verify SMR install */
	        /* Clear the service descriptor placed in shared memory */
			FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
	        pSmrEntryInstall = &(Fota_HseSrvDescriptor.hseSrv.smrEntryInstallReq);

	        /* Fill the service descriptor */
	        Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_SMR_ENTRY_INSTALL;
	        pSmrEntryInstall->accessMode = HSE_ACCESS_MODE_ONE_PASS;
	        pSmrEntryInstall->entryIndex = 0u;
	        pSmrEntryInstall->pSmrEntry = (HOST_ADDR)&smrEntry;

	        pSmrEntryInstall->pSmrData = (HOST_ADDR)TgtAreaAddr;          /* pointing to passive partition */
	        pSmrEntryInstall->smrDataLength = smrEntry.smrSize;
	        pSmrEntryInstall->pAuthTag[0] = (HOST_ADDR)SignatureTagAddr;  /* pointing to passive partition */
	        pSmrEntryInstall->pAuthTag[1] = (HOST_ADDR)SignatureTagAddr;  /* pointing to passive partition */
	        pSmrEntryInstall->authTagLength[0] = (uint16)HmacTagLength;
	        pSmrEntryInstall->authTagLength[1] = (uint16)HmacTagLength;

			hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
	                                               &Fota_HseIpRequest, &Fota_HseSrvDescriptor);
			if(HSE_SRV_RSP_OK != hseRequestResult)
			{
			  retVal|=(Std_ReturnType)E_NOT_OK;
			}

			/* verify SMR entry - SMR verify is not allowed for SHE boot,
			   only on next cycle could it be verified if BOOT_SEQ=0 */
			FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
			pSmrVerifySrv = &(Fota_HseSrvDescriptor.hseSrv.smrVerifyReq);

			Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_SMR_VERIFY;
			pSmrVerifySrv->entryIndex = 0u;
			pSmrVerifySrv->options = HSE_SMR_VERIFICATION_OPTION_PASSIVE_MEM;

			hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
	                                                 &Fota_HseIpRequest, &Fota_HseSrvDescriptor);
			if(HSE_SRV_RSP_OK != hseRequestResult)
			{
			  retVal|=(Std_ReturnType)E_NOT_OK;
			}

			/* Install CR Entry */
			/* Clear the service descriptor placed in shared memory */
			FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));
			pCrEntryInstallSrv = &(Fota_HseSrvDescriptor.hseSrv.crEntryInstallReq);

			/* Fill the service descriptor */
			Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_CORE_RESET_ENTRY_INSTALL;
			pCrEntryInstallSrv->crEntryIndex = 0u;
			pCrEntryInstallSrv->pCrEntry = (HOST_ADDR)&crEntry;

			hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
	                                               &Fota_HseIpRequest, &Fota_HseSrvDescriptor);
			if(HSE_SRV_RSP_OK != hseRequestResult)
			{
			  retVal|=(Std_ReturnType)E_NOT_OK;
			}

			/* verify if secure boot is success */
			FOTA_MEMSET(&Fota_HseSrvDescriptor, 0, sizeof(hseSrvDescriptor_t));

			Fota_HseSrvDescriptor.srvId = HSE_SRV_ID_GET_ATTR;
			Fota_HseSrvDescriptor.hseSrv.getAttrReq.attrId = HSE_SMR_CORE_BOOT_STATUS_ATTR_ID;
			Fota_HseSrvDescriptor.hseSrv.getAttrReq.attrLen = sizeof(hseAttrSmrCoreStatus_t);
			Fota_HseSrvDescriptor.hseSrv.getAttrReq.pAttr = (HOST_ADDR)&smrCoreStatus_Get;

			hseRequestResult = Hse_Ip_ServiceRequest(FOTA_HSE_MU0_INSTANCE, FOTA_HSE_MU_CHANNEL,
	                                               &Fota_HseIpRequest, &Fota_HseSrvDescriptor);
			if(HSE_SRV_RSP_OK != hseRequestResult)
			{
			  retVal|=(Std_ReturnType)E_NOT_OK;
			}

			if(E_OK==retVal)
			{
			  secureBootProcessResult=FOTA_JOB_PENDING_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_IVT_ERASE;
			}
			else
			{
			  secureBootProcessResult=FOTA_JOB_FAILED_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
			}
			break;

		  case FOTA_SECURE_BOOT_IVT_ERASE:

	        #if(FOTA_MCU_MEMORY_ACCESS_TYPE==FOTA_MMU_TYPE) /* MMU TYPE */
			TgtStartAddr=Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress;
			/* polyspace-begin CERT-C:EXP39-C [Justified:Low] "This conversion is used for OSS. they are same type" */
			(void)Fota_PflsGetCovAddr(Fota_MemoryInstance, \
	                                  FOTA_ALT_ADDR, \
	                                  &TgtStartAddr, \
	                                  &TgtStartSize);
			/* polyspace-end CERT-C:EXP39-C [Justified:Low] "This conversion is used for OSS. they are same type" */
	        #endif

			/* passive partition BOOT_SEQ Enable */
		    FOTA_MEMCPY((void *)Fota_IVTBuffer,
	                    (const void *)TgtStartAddr,
	                    Fota_PflsEraseAlignmentValue);

	        (void)Fota_PflsTgtAreaSet(Fota_MemoryInstance,FOTA_ALT_ADDR);

			/* IVT area erase */
			retVal=Fota_PflsEraseRequest(Fota_MemoryInstance, \
	                                      Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress, \
	                                      Fota_PflsEraseAlignmentValue);
			if(E_OK==retVal)
			{
			  secureBootProcessResult=FOTA_JOB_PENDING_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_IVT_ERASE_CHK;
			}
			else
			{
			  secureBootProcessResult=FOTA_JOB_FAILED_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
			}
			break;

		  case FOTA_SECURE_BOOT_IVT_ERASE_CHK:

			memJobResult = (Fota_JobResultType_CallOut)Fota_PflsGetJobResult(Fota_MemoryInstance);
			if (FOTA_JOB_OK_CALL_OUT == memJobResult)
			{
			  secureBootProcessResult=FOTA_JOB_PENDING_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_IVT_WRITE;
			}
			else if (FOTA_JOB_FAILED_CALL_OUT == memJobResult)
			{
			  secureBootProcessResult=FOTA_JOB_FAILED_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
			}
			else
			{
			  secureBootProcessResult=FOTA_JOB_PENDING_CALL_OUT;
			}
			break;

		  case FOTA_SECURE_BOOT_IVT_WRITE:
			Fota_IVTBuffer[FOTA_FOUR] |= BOOT_SEQ_MASK; /* 4~7: Boot configuration word */

			retVal=Fota_PflsWriteRequest(Fota_MemoryInstance, \
	                                     Fota_Gast_SwUnitTable[EcuSwUnitIdx].StartAddress, \
	                                     Fota_IVTBuffer, \
	                                     Fota_PflsEraseAlignmentValue);
			if(E_OK==retVal)
			{
			  secureBootProcessResult=FOTA_JOB_PENDING_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_IVT_WRITE_CHK;
			}
			else
			{
			  secureBootProcessResult=FOTA_JOB_FAILED_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
			}
			break;

