YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
		  case FOTA_SECURE_BOOT_IVT_WRITE_CHK:

			memJobResult = (Fota_JobResultType_CallOut)Fota_PflsGetJobResult(Fota_MemoryInstance);
			if (FOTA_JOB_OK_CALL_OUT == memJobResult)
			{
			  secureBootProcessResult=FOTA_JOB_OK_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
			}
			else if (FOTA_JOB_FAILED_CALL_OUT == memJobResult)
			{
			  secureBootProcessResult=FOTA_JOB_FAILED_CALL_OUT;
			  macUpdateStat=FOTA_SECURE_BOOT_MAC_GENERATE;
			}
			else
			{
			  secureBootProcessResult=FOTA_JOB_PENDING_CALL_OUT;
			}
			break;
		  default:
      /* Do Nothing */
			break;
	    }
	  }
	  /* polyspace-end CERT-C:INT36-C, MISRA-C3:10.5,11.4 [Justified:Low] "No Impact of this rule violation" */

	  return secureBootProcessResult;
    }
  #endif /* HWRESOURCE_VENDOR(HWRESOURCE_NXP) */

  /* polyspace-begin MISRA-C3:2.7,8.13 [Justified:Low] "Not a defect" */
  FUNC(Std_ReturnType, FOTA_CODE) Fota_DeriveKeyRequest_Callout
  (
    uint8 *Lpu8_MetaDataBuffer,
    uint8 MDBlockId,
    uint32 KDFKeyId,
    uint32 KDFResultKeyId,
    uint32 Csm_Meta_Header_Length,
    uint32 Csm_Meta_SK_Length
  )
  /* polyspace-end MISRA-C3:2.7,8.13 [Justified:Low] "Not a defect" */
  {
    Std_ReturnType retVal = E_NOT_OK;
    uint8 Lu8_Index;

    uint32 KDFcounter[1] = {1024};
    uint32 KDFPSKindexLen = 1u; /* for HSM index */
    uint32 KDFResultLen = FOTA_DERIVEKEY_LENGTH;
    uint8 Lau8_SecureFlashDerivedKey[FOTA_DERIVEKEY_LENGTH];
    uint32 KDFAlgorithm[1] = {0x81}; /* for HSM index */
    #if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))
      uint8 rul_ExtractedKey[FOTA_DERIVEKEY_LENGTH];
      uint8 Pbkdf2_Encrypted_DerivedKey[FOTA_DERIVEKEY_LENGTH];
      uint32 ElementIndex = 0; /* Temparary value for Crypto Defect */
      uint32 KDFcounterLen = 4;
    #endif
	FOTA_MEMSET(Lau8_SecureFlashDerivedKey, 0, FOTA_DERIVEKEY_LENGTH);

    #if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))

      retVal = Csm_KeyElementSet(\
        (SEC_SF_PBKDF2_SOURCE_KEY_PSK_OFFSET+(uint32)(Fota_Gu8_MetadataPSKidx)),\
        FOTA_CSM_KE_ID_SALT,\
        &Lpu8_MetaDataBuffer[Csm_Meta_Header_Length],\
        Csm_Meta_SK_Length);

      retVal |= Csm_KeyElementSet(\
        (SEC_SF_PBKDF2_SOURCE_KEY_PSK_OFFSET+(uint32)(Fota_Gu8_MetadataPSKidx)),\
        FOTA_CSM_KE_ID_ITERATION,\
        (uint8 *)KDFcounter,\
        KDFcounterLen);

      retVal |= Csm_KeyElementSet(\
        SEC_SF_PBKDF2_EXTRACTED_KEY,\
        FOTA_CSM_KE_ID_MAINKEY,\
        rul_ExtractedKey,\
        FOTA_DERIVEKEY_LENGTH);

      retVal |= Csm_KeySetValid(SEC_SF_PBKDF2_ENCRYPT_KEY);
      retVal |= Csm_KeySetValid(SEC_SF_PBKDF2_DECRYPT_KEY);
      retVal |= Csm_KeySetValid(SEC_SF_PBKDF2_SOURCE_KEY_PSK_OFFSET+(uint32)(Fota_Gu8_MetadataPSKidx));

      /* polyspace-begin DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */
      ElementIndex = Crypto_Util_GetKeyElementIdx (Crypto_Util_GetKeyIdx(SEC_SF_PBKDF2_ENCRYPT_KEY), CRYPTO_KE_CIPHER_KEY);
        *Crypto_aKeyElementList[ElementIndex].pu32CryptoElementActualSize = 16U;
      ElementIndex = Crypto_Util_GetKeyElementIdx (Crypto_Util_GetKeyIdx(SEC_SF_PBKDF2_DECRYPT_KEY), CRYPTO_KE_CIPHER_KEY);
        *Crypto_aKeyElementList[ElementIndex].pu32CryptoElementActualSize = 16U;
      ElementIndex = Crypto_Util_GetKeyElementIdx (Crypto_Util_GetKeyIdx(SEC_SF_PBKDF2_SOURCE_KEY_PSK_OFFSET+(uint32)(Fota_Gu8_MetadataPSKidx)), CRYPTO_KE_KEYDERIVATION_PASSWORD);
        *Crypto_aKeyElementList[ElementIndex].pu32CryptoElementActualSize = 16U;
      /* polyspace-end DEFECT:OUT_BOUND_ARRAY, CERT-C:ARR30-C, MISRA-C3:18.1 [Justified:High] "It gets array index in range" */


      if(E_OK == retVal)
      {
        retVal |= Csm_KeyDerive(
                  (SEC_SF_PBKDF2_SOURCE_KEY_PSK_OFFSET \
                    + (uint32)(Fota_Gu8_MetadataPSKidx)),
                  SEC_SF_PBKDF2_TARGET_KEY);

#if 0
        retVal |= Csm_KeyCopy(SEC_SF_PBKDF2_TARGET_KEY, SEC_SF_PBKDF2_EXTRACTED_KEY);
#else
        retVal |= Csm_KeyElementCopyPartial(SEC_SF_PBKDF2_TARGET_KEY,SEC_SF_PBKDF2_TARGET_ELEMENT,0U,0U,\
                  FOTA_DERIVEKEY_LENGTH,SEC_SF_PBKDF2_EXTRACTED_KEY,SEC_SF_PBKDF2_EXTRACTED_ELEMENT);
#endif

        retVal |= Csm_KeyElementGet(SEC_SF_PBKDF2_EXTRACTED_KEY,\
                  FOTA_CSM_KE_ID_MAINKEY,\
                  Pbkdf2_Encrypted_DerivedKey,\
                  &KDFResultLen);

        retVal |= Csm_Decrypt(SEC_SF_PBKDF2_DECRYPT_AES_ECB,\
                CRYPTO_OPERATIONMODE_SINGLECALL,\
                Pbkdf2_Encrypted_DerivedKey,\
                KDFResultLen,\
                Lau8_SecureFlashDerivedKey,\
                &KDFResultLen);
      }
    #else /* HWRESOURCE_VENDOR(HWRESOURCE_NXP) */
      retVal = \
          Csm_KeyElementSet(KDFKeyId, \
            FOTA_CSM_KE_ID_HSMINDEX, \
            &Fota_Gu8_MetadataPSKidx, \
            KDFPSKindexLen);

      retVal |= \
          Csm_KeyElementSet(KDFKeyId, \
            FOTA_CSM_KE_ID_SALT, \
            &Lpu8_MetaDataBuffer[Csm_Meta_Header_Length], \
            Csm_Meta_SK_Length);

      /* KeyElementId : Iteration */
      retVal |= \
          Csm_KeyElementSet(KDFKeyId, \
            FOTA_CSM_KE_ID_ITERATION, \
            (uint8*)KDFcounter, \
            sizeof(KDFcounter));

      retVal |= \
          Csm_KeyElementSet(KDFKeyId, \
            FOTA_CSM_KE_ID_ALGORITHM, \
            (uint8*)KDFAlgorithm, \
            sizeof(KDFAlgorithm));

      retVal |= Csm_KeySetValid(KDFKeyId);

      retVal |= \
          Csm_KeyElementSet(KDFResultKeyId, \
            FOTA_CSM_KE_ID_MAINKEY, \
            Lau8_SecureFlashDerivedKey, \
            sizeof(Lau8_SecureFlashDerivedKey));

      retVal |= Csm_KeySetValid(KDFResultKeyId);

      if(E_OK == retVal)
      {
        retVal |= Csm_KeyDerive(KDFKeyId, KDFResultKeyId);

        retVal |= Csm_KeyElementGet(KDFResultKeyId, FOTA_CSM_KE_ID_MAINKEY, \
          Lau8_SecureFlashDerivedKey, &KDFResultLen);
      }
    #endif /* HWRESOURCE_VENDOR(HWRESOURCE_NXP) */

