YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
    if (E_OK == retVal)
    {
      for (Lu8_Index = 0U; Lu8_Index < FOTA_DEC_KEY_LENGTH; Lu8_Index++)
      {
        rst_MetaPars.FirmwareKeyPtr[Lu8_Index]
          = Lau8_SecureFlashDerivedKey[Lu8_Index];
      }

      for (Lu8_Index = 0U; Lu8_Index < FOTA_MAC_LENGTH; Lu8_Index++)
      {
        rst_MetaPars.MacKeyPtr[Lu8_Index]
          = Lau8_SecureFlashDerivedKey[FOTA_DEC_KEY_LENGTH + Lu8_Index];
      }
    }

    return retVal;
  }

#endif /* (FOTA_STD_ON == FOTA_SF20_ENABLE)*/

#if (HWRESOURCE_FAMILY(HWRESOURCE_S32K31X))
#include "Power_Ip_MC_RGM.h"
/* polyspace-begin MISRA-C3:8.4,8.9,11.4 [Justified:Low] "No Impact of this rule violation" */
static Power_Ip_MC_RGM_Type * Fota_Power_Ip_pxMC_RGM = (Power_Ip_MC_RGM_Type *)IP_MC_RGM_BASE;

uint32 JYSRegValue = 0U;
/* polyspace-end MISRA-C3:8.4,8.9,11.4 [Justified:Low] "No Impact of this rule violation" */

static FUNC(Std_ReturnType, FOTA_CODE) Mcu_s32k3xx_GetResetReason(void)
{
	/* Temporary variables for DES and FES registers value. */
	uint32 RegValue = 0U;
	Std_ReturnType retVal;
	/* Check "Destructive Reset Reason" from DES Status Register. */
	RegValue = Fota_Power_Ip_pxMC_RGM->DES & MC_RGM_DES_RWBITS_MASK32;

	JYSRegValue = RegValue;

	if ((uint32)0U != RegValue)
	{
		/* Cold start */
		retVal = E_NOT_OK;
	}
	else
	{
		/* Warm start */
		retVal = E_OK;
	}

	return retVal;
}

/* polyspace-begin MISRA-C3:8.9,11.4 [Justified:Low] "No Impact of this rule violation" */
static Power_Ip_MC_ME_Type * Power_Ip_pxMC_ME = (Power_Ip_MC_ME_Type *)IP_MC_ME_BASE;
/* polyspace-end MISRA-C3:8.9,11.4 [Justified:Low] "No Impact of this rule violation" */

static FUNC(void, FOTA_CODE) Mcu_S32k31x_Reset(void)
{
  /* Makes a request to trigger a Destructive Reset Event */
  Power_Ip_pxMC_ME->MODE_CONF=MC_ME_MODE_CONF(MC_ME_MODE_CONF_FUNC_RST_MASK);
  Power_Ip_pxMC_ME->MODE_UPD = MC_ME_MODE_UPD_MODE_UPD(MC_ME_MODE_UPD_MODE_UPD_MASK);
  /* Write key to MC_ME_CTL_KEY */
  Power_Ip_pxMC_ME->CTL_KEY = MC_ME_CTL_KEY_KEY(MC_ME_CTL_KEY_DIRECT_KEY_U32);

  /* Write inverted key to MC_ME_CTL_KEY */
  Power_Ip_pxMC_ME->CTL_KEY = MC_ME_CTL_KEY_KEY(MC_ME_CTL_KEY_INVERTED_KEY_U32);
}
#endif

#if (HWRESOURCE_FAMILY(HWRESOURCE_TC21X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC22X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC23X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC26X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC27X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC29X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC33X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC36X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC37X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC38X) ||\
     HWRESOURCE_FAMILY(HWRESOURCE_TC39X))
static FUNC(Std_ReturnType, FOTA_CODE) Mcu_tcxxx_GetResetReason(void)
{
  Std_ReturnType retVal;
  Ifx_SCU_RSTSTAT resetState = SCU_RSTSTAT;
  /* polyspace-begin MISRA-C3:2.2 [Not a defect:Low] "No Impact of this rule violation" */
  /* Check for reset warm start */
  if (0x1 == (resetState.B.SW))
  {
    retVal = E_OK;
  }
  else
  {
    retVal = E_NOT_OK;
  }
  /* polyspace-end MISRA-C3:2.2 [Not a defect:Low] "No Impact of this rule violation" */
  return retVal;
}

static FUNC(void, FOTA_CODE) Mcu_Tcxxx_Reset(void)
{
  EcuM_UserType user = 0;
  (void)EcuM_SelectShutdownTarget(ECUM_STATE_RESET, ECUM_RESET_MCU);
  (void)EcuM_ReleaseRUN(user);
}
#endif

#if (HWRESOURCE_FAMILY(HWRESOURCE_S32K14X))
static FUNC(Std_ReturnType, FOTA_CODE) Mcu_s32k14x_GetResetReason(void)
{
  Std_ReturnType retVal;
  if ((REG_READ32(RCM_SRS_ADDR32) & RCM_SRS_SW_MASK32) == RCM_SRS_SW_MASK32)
  {
    /* warm start(software reset) is executed */
    retVal = E_OK;
  }
  else
  {
    retVal = E_NOT_OK;
  }
  return retVal;
}

static FUNC(void, FOTA_CODE) Mcu_S32k14x_Reset(void)
{
  ASM_KEYWORD(" dsb");               /* All memory accesses have to be completed before reset */
  /** @violates @ref Mcu_CortexM4_c_REF_4 Required Rule 11.1, Conversion from integer to pointer */
  /** @violates @ref Mcu_CortexM4_c_REF_5 The cast is used to access memory mapped registers.*/
  REG_WRITE32( CM4_AIRCR_BASEADDR, (uint32)(CM4_AIRCR_VECTKEY(0x5FAU) |
                                            (REG_READ32(CM4_AIRCR_BASEADDR) & CM4_AIRCR_PRIGROUP_MASK) |
                                            CM4_AIRCR_SYSRESETREQ_MASK ));
  ASM_KEYWORD(" dsb");               /* All memory accesses have to be completed */
}

#endif

#if ((HWRESOURCE_FAMILY(HWRESOURCE_MPC5606X)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_MPC5606X)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_MPC5607X)))
static FUNC(Std_ReturnType, FOTA_CODE) Mcu_mpc560xb_GetResetReason(void)
{
  Std_ReturnType retVal;
  /* polyspace-begin DEFECT:DEAD_CODE, MISRA-C3:14.3,2.1 [Justified:Low] "if-condition depends on the MCU." */
  if ((RGM_FES_F_SOFT & (uint32)RGM_FES_SOFT) == TRUE)
  {
    /* warm start(software reset) is executed */
    retVal = E_OK;
  }
  else
  {
    retVal = E_NOT_OK;
  }
  /* polyspace-end DEFECT:DEAD_CODE, MISRA-C3:14.3,2.1 [Justified:Low] "if-condition depends on the MCU." */
  return retVal;
}

static FUNC(void, FOTA_CODE) Mcu_Mpc560xx_Reset(void)
{
  uint32 Lu32_Indx = 0UL;

  /* ME_MCTRL (SV)                                          */
  /* -trigger s/w-controlled mode changes                   */
  /*--------------------------------------------------------*/
  /*  TARGET_MODE[0:3] - RESET(0),TEST(1),SAFE(2),DRUN(3)   */
  /*                     RUN0/1/2/3(4/5/6/7),HALT0(8),STOP0(10 */
  /*  KEY[16:31] - Key(0x5AF0),Inverted Key(0xA50F)         */

  REG_WRITE32(MC_ME_MCTL_R, (0U | MCU_SOFT_CONTROL_KEY_ONE));
  REG_WRITE32(MC_ME_MCTL_R, (0U | MCU_SOFT_CONTROL_KEY_TWO));

  do
  {
      /* polyspace-begin DEFECT:DEAD_CODE, MISRA-C3:14.3,2.1 [Justified:Low] "No Impact of this rule violation. Fail-safe." */
      if (Lu32_Indx > 4294967295UL)
      {
          break;
      }
      /* polyspace-end DEFECT:DEAD_CODE, MISRA-C3:14.3,2.1 [Justified:Low] "No Impact of this rule violation. Fail-safe." */
      Lu32_Indx++;
  }
  while ((MC_ME_GS & (MCU_TRANSITION_STATUS)) == MCU_TRANSITION_STATUS);
}
#endif /* #if (HWRESOURCE_FAMILY(HWRESOURCE_MPC560XB)) */

