YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
#if ((HWRESOURCE_FAMILY(HWRESOURCE_SPC58XC)) ||\
      (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XB)) ||\
      (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XG)) ||\
      (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)))
static FUNC(Std_ReturnType, FOTA_CODE) Mcu_spc58x_GetResetReason(void)
{
  uint32 porValue;
  Std_ReturnType retVal;

  porValue = SYST_MC_POWER_ON_START();
  if(FALSE != porValue)
  {
    /* Clear the power on reset. It is required for detection of warm start
     * and to clear the BTL and APP shared memory.
     * APPLICATION may also need Power on reset bit to trigger further
     * actions. For now it is a work around but bootloader
     * should not modify this bit for proper functioning of application
     * software.
     */

   /* Cold start - The start-up of the ECU from a powered-down or off state */
    retVal = E_NOT_OK;
  }
  else
  {
    /* Warm start means that the MCU does have a continuous power supply
     * and the RESET is not from the change of Vcc,
     * he reset was generated by watchdog, software, etc etc ..
     */
    retVal = E_OK;
  }
  return retVal;
}

static FUNC(void, FOTA_CODE) Mcu_Spc58x_Reset(void)
{
  MC_ME_MCTL = 0x00005AF0U; /* Target mode = DRUN, KEY = 5AF0*/
  MC_ME_MCTL = 0x0000A50FU; /* Target mode = DRUN, KEY = A50F*/
}
#endif /* #if (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XC)) */

#if ((HWRESOURCE_FAMILY(HWRESOURCE_CYT2BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT3BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT4BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT6BXX)))
static FUNC(Std_ReturnType, FOTA_CODE) Mcu_cytxxx_GetResetReason(void)
{
  Std_ReturnType Ldt_retvalue;

  /* Reset Status Register - Power-On Reset Status
   * 1 A Power-On Reset has occurred.
   * 0 No Power-On Reset has occurred.
   */

  if ((CY_SYSRESET_SOFT != *CYTXXX_SRSS & CY_SYSRESET_MASK))
  {
    /* Clear the power on reset. It is required for detection of warm start
     * and to clear the BTL and APP shared memory.
     * APPLICATION may also need Power on reset bit to trigger further
     * actions. For now it is a work around but bootloader
     * should not modify this bit for proper functioning of application
     * software.
     * It is valid only when only SW Reset bit is set */

    /* Cold start - The start-up of the ECU from a powered-down or off state */
    Ldt_retvalue = E_NOT_OK;
  }
  else
  {
    /* Warm start means that the MCU does have a continuous power supply
     * and the RESET is not from the change of Vcc,
     * he reset was generated by watchdog, software, etc etc ..
     */
    Ldt_retvalue = E_OK;
  }
  return Ldt_retvalue;
}
#endif

#if ((HWRESOURCE_FAMILY(HWRESOURCE_CYT2BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT3BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT4BXX)) ||\
     (HWRESOURCE_FAMILY(HWRESOURCE_CYT6BXX)))
static FUNC(void, FOTA_CODE) Mcu_Cytxxx_Reset(void)
{
  /* Ensure all outstanding memory accesses included
    buffered write are completed before reset */
  __asm("dsb");
  /* Keep priority group unchanged */
  *CYTXXX_SCB_AIRCR = (uint32)((0x5FAUL << SCB_AIRCR_VECTKEY_Pos)    |
                        (*CYTXXX_SCB_AIRCR & SCB_AIRCR_PRIGROUP_Msk) |
                         SCB_AIRCR_SYSRESETREQ_Msk);
  /* Ensure completion of memory access */
  __asm("dsb");
  while(1)
  {
    /* Wait until reset */
  }
}
#endif

#if (HWRESOURCE_MCU(HWRESOURCE_RH850F1KM))
static FUNC(Std_ReturnType, FOTA_CODE) Mcu_Rh850F1km_GetResetReason(void)
{
  Std_ReturnType Ldt_retvalue;

  /* Reset Status Register - Power-On Reset Status
   * 1 Soft Reset has occurred.
   * 0 No Soft Reset has occurred.
   */
  if (1 != SYST_MC_SOFT_RESET_ON_START())
  {
    /* Clear the power on reset. It is required for detection of warm start
     * and to clear the BTL and APP shared memory.
     * APPLICATION may also need Power on reset bit to trigger further
     * actions. For now it is a work around but bootloader
     * should not modify this bit for proper functioning of application
     * software.
     */

   /* Cold start - The start-up of the ECU from a powered-down or off state */
    Ldt_retvalue = E_NOT_OK;
  }
  else
  {
    /* Warm start means that the MCU does have a continuous power supply
     * and the RESET is not from the change of Vcc,
     * he reset was generated by watchdog, software, etc etc ..
     */
    Ldt_retvalue = E_OK;
  }

  return Ldt_retvalue;
}

static FUNC(void, FOTA_CODE) Mcu_Rh850F1km_Reset(void)
{
  /* clear power reset because after softreset is execute,
    power reset still keep active value (power on reset event)
    => when init MCU, Os check this value and clear RAM value (power on reset event).
       After clear power reset bit, then soft-reset execute,
       OS isn't clear RAM value */
  protected_write(WPROTREG.ulPROTCMD0, WPROTREG.ulPROTS0, RESFREG.ulRESFC,
    (RESFREG.ulRESFC & (~(uint32)0x00000200)));     /* Enable PLL */
  /* SW reset */
  protected_write(WPROTREG.ulPROTCMD0, WPROTREG.ulPROTS0, RESFREG.ulSWRESA, 0x01u);
}
#endif /* #if (HWRESOURCE_MCU(HWRESOURCE_RH850F1KM)) */

#if ((HWRESOURCE_MCU(HWRESOURCE_RH850F1K)) |\
     (HWRESOURCE_MCU(HWRESOURCE_RH850F1L)))
#pragma asm
.text
.align  2
.global _WritetProtectRegister
_WritetProtectRegister:
  prepare {r20,r21}, 8
  mov   0x000000a5, r20
  not   r7, r21

  st.w  r20, 0[r8]
  st.w  r7, 0[r6]
  st.w  r21, 0[r6]
  st.w  r7, 0[r6]

  dispose 8, {r20,r21}
  jmp   [lp]
#pragma endasm

Std_ReturnType Mcu_Rh850F1x_GetResetReason(void)
{
  Std_ReturnType Ldt_retvalue;

  /* Reset Status Register - Power-On Reset Status
   * 1 A Power-On Reset has occurred.
   * 0 No Power-On Reset has occurred.
   */
  if(TRUE == SYST_MC_POWER_ON_START_F1K())
  {
    /* Cold start - The start-up of the ECU from a powered-down or off state */
    Ldt_retvalue = E_NOT_OK;
  }
  else
  {
    /* Warm start means that the MCU does have a continuous power supply
     * and the RESET is not from the change of Vcc,
     * he reset was generated by watchdog, software, etc etc ..
     */
    Ldt_retvalue = E_OK;
  }
  return Ldt_retvalue;
}

static FUNC(void, FOTA_CODE) Mcu_Rh850F1x_Reset(void)
{
  WritetProtectRegister( (uint32 *)&SWRESA, 0x1, (uint32 *)&PROTCMD0);
}
#endif


FUNC(Std_ReturnType, FOTA_CODE) Fota_IsWarmReset(void)
{
	Std_ReturnType retVal = E_NOT_OK;
  #if (HWRESOURCE_FAMILY(HWRESOURCE_S32K31X))
	retVal = Mcu_s32k3xx_GetResetReason();
  #elif (HWRESOURCE_FAMILY(HWRESOURCE_TC21X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC22X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC23X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC26X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC27X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC29X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC33X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC36X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC37X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC38X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC39X))
  retVal = Mcu_tcxxx_GetResetReason();
  #elif (HWRESOURCE_FAMILY(HWRESOURCE_S32K14X))
  retVal = Mcu_s32k14x_GetResetReason();
  #elif (HWRESOURCE_FAMILY(HWRESOURCE_S32K31X))
  retVal = Mcu_s32k3xx_GetResetReason();
  #elif ((HWRESOURCE_FAMILY(HWRESOURCE_MPC5606X)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_MPC5606X)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_MPC5607X)))
  retVal = Mcu_mpc560xb_GetResetReason();
  #elif ((HWRESOURCE_FAMILY(HWRESOURCE_SPC58XC)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XB)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XG)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)))
  retVal = Mcu_spc58x_GetResetReason();
  #elif ((HWRESOURCE_FAMILY(HWRESOURCE_CYT2BXX)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_CYT3BXX)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_CYT4BXX)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_CYT6BXX)))
  retVal = Mcu_cytxxx_GetResetReason();
  #elif (HWRESOURCE_MCU(HWRESOURCE_RH850F1KM))
  retVal = Mcu_Rh850F1km_GetResetReason();
  #elif ((HWRESOURCE_MCU(HWRESOURCE_RH850F1K)) |\
         (HWRESOURCE_MCU(HWRESOURCE_RH850F1L)))
  retVal = Mcu_Rh850F1x_GetResetReason();
  #else
  #endif

  return retVal;
}

