YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
/*******************************************************************************
** Function Name        : EcuM_RequestReset                                   **
**                                                                            **
** Service ID           : None                                                **
**                                                                            **
** Description          : Integration Code For Request Reset using Release    **
**                        Run API                                             **
**                                                                            **
** Sync/Async           : Synchronous                                         **
**                                                                            **
** Reentrancy           : Reentrant                                           **
**                                                                            **
** Input Parameters     : user                                                **
**                                                                            **
** InOut parameter      : None                                                **
**                                                                            **
** Output Parameters    : None                                                **
**                                                                            **
** Return parameter     : Std_ReturnType (E_OK or E_NOT_OK)                   **
**                                                                            **
** Preconditions        : None                                                **
**                                                                            **
** Remarks              : Global Variable(s)     :                            **
**                                                                            **
**                        Function(s) invoked    : EcuM_SelectShutdownTarget  **
**                                                 EcuM_ReleaseRUN            **
*******************************************************************************/
FUNC(void, FOTA_CODE) Fota_RequestReset(void)
{
  #if ((HWRESOURCE_FAMILY(HWRESOURCE_CYT2BXX)) ||\
       (HWRESOURCE_FAMILY(HWRESOURCE_CYT3BXX)) ||\
       (HWRESOURCE_FAMILY(HWRESOURCE_CYT4BXX)) ||\
       (HWRESOURCE_FAMILY(HWRESOURCE_CYT6BXX)))
  Mcu_Cytxxx_Reset();
  #elif (HWRESOURCE_FAMILY(HWRESOURCE_S32K14X))
  Mcu_S32k14x_Reset();
  #elif (HWRESOURCE_FAMILY(HWRESOURCE_S32K31X))
  Mcu_S32k31x_Reset();
  #elif ((HWRESOURCE_FAMILY(HWRESOURCE_MPC5605X)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_MPC5606X)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_MPC5607X)))
  Mcu_Mpc560xx_Reset();
  #elif ((HWRESOURCE_FAMILY(HWRESOURCE_SPC58XC)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XB)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XG)) ||\
         (HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)))
  Mcu_Spc58x_Reset();
  #elif (HWRESOURCE_MCU(HWRESOURCE_RH850F1KM))
  Mcu_Rh850F1km_Reset();
  #elif ((HWRESOURCE_MCU(HWRESOURCE_RH850F1K)) |\
         (HWRESOURCE_MCU(HWRESOURCE_RH850F1L)))
  Mcu_Rh850F1x_Reset();
  #elif (HWRESOURCE_FAMILY(HWRESOURCE_TC21X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC22X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC23X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC26X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC27X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC29X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC33X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC36X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC37X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC38X) ||\
         HWRESOURCE_FAMILY(HWRESOURCE_TC39X))
  Mcu_Tcxxx_Reset();
  #else
  #endif
}

FUNC(uint16, FOTA_CODE) Fota_OutDelayTime_Callout(void)
{
  Std_ReturnType LddRetVal = 0x03U;

  return LddRetVal;
}

#if ((FOTA_DOWN_GRADE_PROTECTION_USED==STD_ON) && (FOTA_MCU_MEMORY_ACCESS_TYPE!=FOTA_SINGLE_TYPE))
FUNC(Std_ReturnType, FOTA_CODE) Fota_DualMemDownGradeChk_Callout(void)
{
	/* Downgrade check rule                                       */
	/* if Target Partition Version >= Active Partition Version    */
	/* then return E_OK (upgrade or same version case)            */
	/* else return E_NOT_OK (downgrade case)                      */
    /* refer to UM if you want more information                   */
	/* check All of SwUnit                                        */
	/* if security level is OEUK, return E_OK                     */


	VAR(Std_ReturnType, FOTA_CODE) retVal = E_NOT_OK;
	Dcm_SecLevelType			   ren_SecLevel;

#if (FOTA_MCU_MEMORY_ACCESS_TYPE!=FOTA_MMU_TYPE)
	Fota_PartitionType             LenActivePartition;
#endif

	if(Dcm_GetSecurityLevel(&ren_SecLevel)==E_OK)
	{
		/* rollback case (OEUK)*/
		if(ren_SecLevel == FOTA_SECURITY_ROW_L10)
		{
			retVal = E_OK;
		}
		else
		{
			/* Version comare code should be bellow for downgrade check  */
			/* All of SwUnit should be checked                           */

			/*********************************************************/
			/* Version Check Rule                                    */
			/*            Running Partitition   Target Partition     */
			/* TV II     : Always A part (STD)   Always B part (ALT) */
			/* Aurix 2G	 : Always A part (STD)   Always B part (ALT) */
			/* S32K3	 : Always A part (STD)   Always B part (ALT) */
			/* SPC58xH   : Always A part (STD)   Always B part (ALT) */
			/* SPC58xC   : Depends on PC         Depends on PC       */
			/* RH850     : Depends on PC         Depends on PC       */
			/*********************************************************/

			 #if (FOTA_MCU_MEMORY_ACCESS_TYPE == FOTA_MMU_TYPE)
			 /**************************************************************************************************/
			 /*                                    MMU MCU                                                     */
			 /* version compare rutine should be hear                                                          */
			 /* Upgrade Case   : return CODEFLASH_RET_OK  (Version in Inactive area >= Version in Active area) */
			 /* Downgrade Case : return CODEFLASH_RET_ERR (Version in Inactive area <  Version in Active area) */
			 /**************************************************************************************************/

			 /* Always Running Partition is A */

            /* user should fill below code if MMU*/
			 /*@ if((*(uint32*)(ACTIVE_AREA_VERSION_ADDR_SWUNIT1) <= *(uint32*)(INACTIVE_AREA_VERSION_ADDR_SWUNIT1)) &&    */
			 /*@    (*(uint32*)(ACTIVE_AREA_VERSION_ADDR_SWUNIT2) <= *(uint32*)(INACTIVE_AREA_VERSION_ADDR_SWUNIT2)) &&    */
			 /*@     ... Number of SwUnits      		                                                                   */
			 /*@ {	                                                                                                       */
			 /*@     ren_Ret=E_OK;                                                                                         */
			 /*@ }                                                                                                         */
			 /*@ else                                                                                                      */
			 /*@ {                                                                                                         */
			 /*@     ren_Ret=E_NOT_OK;                                                                                     */
			 /*@ }                                                                                                         */

			 #else

			  if(Fota_GetActivePartition(&LenActivePartition)==E_OK)
			  {
				  if(LenActivePartition==FOTA_PARTITION_A)
				  {
				  /**************************************************************************************************/
				  /*                                  Non MMU MCU (Partition_A Active case)                         */
				  /* version compare rutine should be hear                                                          */
				  /* Upgrade Case   : return E_OK  (Version in Partition B >= Version in Partition A)               */
				  /* Downgrade Case : return E_NOT_OK (Version in Partition B < Version in Partition A)             */
				  /**************************************************************************************************/

