YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
				 /* user should fill below code if Non MMU*/
				 /*@    if(*(uint32*)(PARTA_VERSION_ADDR) <= *(uint32*)(PARTB_VERSION_ADDR))            */
				 /*@    {                                                                               */
				 /*@ 		retVal = E_OK;                                                              */
				 /*@    }                                                                               */
				 /*@    else                                                                            */
				 /*@    {                                                                               */
				 /*@   	    retVal = E_NOT_OK;                                                          */
				 /*@    }                                                                               */

				  }
				  else if(LenActivePartition==FOTA_PARTITION_B)
				  {

				  /**************************************************************************************************/
				  /*                                  Non MMU MCU (Partition_B Active case)                         */
				  /* version compare rutine should be hear                                                          */
				  /* Upgrade Case   : return E_OK  (Version in Partition A >= Version in Partition B)               */
				  /* Downgrade Case : return E_NOT_OK (Version in Partition A < Version in Partition B)             */
				  /**************************************************************************************************/

				 /* user should fill below code if Non MMU*/
				 /*@    if(*(uint32*)(PARTB_VERSION_ADDR) <= *(uint32*)(PARTA_VERSION_ADDR))            */
				 /*@    {                                                                               */
				 /*@ 	    retVal = E_OK;                                                              */
				 /*@    }                                                                               */
				 /*@    else                                                                            */
				 /*@    {                                                                               */
				 /*@   	    retVal = E_NOT_OK;                                                          */
				 /*@    }                                                                               */

				  }
				  else
				  {
					  retVal = E_NOT_OK;
				  }
			  }
			  else
			  {
				  retVal = E_NOT_OK;
			  }

		     #endif

		}
	}
	else
	{
		retVal = E_NOT_OK;
	}

	return retVal;
}
#endif


#if (FOTA_MCU_MEMORY_ACCESS_TYPE!=FOTA_SINGLE_TYPE)
FUNC(Std_ReturnType, FOTA_CODE) Fota_DualMemSwUnitsVerDependChk_Callout(void)
{
	VAR(Std_ReturnType, FOTA_CODE) retVal = E_NOT_OK;
	/* version check rule                                                                      */
	/* You must check the version dependencies of all SwUnit                                   */
	/* Here, version dependency between SwUnits is checked.                                    */
	/* The version location is the SwUnit location in the inactive area                        */
	/* In the case of Non MMU, only a single SwUnit is supported, so it always returns as E_OK */

	#if(FOTA_MCU_MEMORY_ACCESS_TYPE==FOTA_MMU_TYPE)
	/* Version comare code should be bellow */






	    retVal = E_OK;

	#else
		retVal = E_OK;
    #endif


	return retVal;
}
#endif


#if ((FOTA_SOFTWARE_VERSION_CHECK == STD_ON) &&\
  (FOTA_MCU_MEMORY_ACCESS_TYPE == FOTA_SINGLE_TYPE))
/* polyspace-begin MISRA-C3:8.13 [Justified:Low] "Not a defect" */
static FUNC(Fota_VersionCompareCallOutType, FOTA_CODE) Fota_CompareVersionCallOut(
                                        uint8 *newVer, uint8 lengthNewVer,
                                        uint8 *currentVersion, uint8 lengthCurrent)
/* polyspace-end MISRA-C3:8.13 [Justified:Low] "Not a defect" */
{
  Fota_VersionCompareCallOutType result=FOTA_VERSION_CHECK_CALLOUT_EQUAL;
  uint8 index;

  if (lengthNewVer > lengthCurrent)
  {
    result = FOTA_VERSION_CHECK_CALLOUT_GREATER;
  }
  else if (lengthCurrent < lengthNewVer)
  {
    result = FOTA_VERSION_CHECK_CALLOUT_SMALLER;
  }
  else
  {
    /* Check the Header is fully written */
    for (index = 0; index < lengthCurrent; index++)
    {
      if (currentVersion[index] == newVer[index])
      {
        result = FOTA_VERSION_CHECK_CALLOUT_EQUAL;
      }
      else if (newVer[index] > currentVersion[index])
      {
        result = FOTA_VERSION_CHECK_CALLOUT_GREATER;
      }
      else
      {
        result = FOTA_VERSION_CHECK_CALLOUT_SMALLER;
      }

      if (result!=FOTA_VERSION_CHECK_CALLOUT_EQUAL)
      {
        break;
      }
    }
  }
  return result;
}
#endif /* #if (FOTA_DOWN_GRADE_PROTECTION_USED == FOTA_STD_ON) */

#if ((FOTA_SOFTWARE_VERSION_CHECK == STD_ON) &&\
  (FOTA_MCU_MEMORY_ACCESS_TYPE == FOTA_SINGLE_TYPE))
/* polyspace-begin MISRA-C3:2.7,8.13 [Justified:Low] "Not a defect" */
FUNC(Std_ReturnType, FOTA_CODE) Fota_SvcCheckVersion(uint8 *newVer, uint8 lengthNewVer,
                                    uint8 *currentVersion, uint8 lengthCurrent)
/* polyspace-end MISRA-C3:2.7,8.13 [Justified:Low] "Not a defect" */
{
  Std_ReturnType retVal=E_NOT_OK;
  Dcm_SecLevelType  secLevel;
  Fota_VersionCompareCallOutType result;
  if (Dcm_GetSecurityLevel(&secLevel) == (Std_ReturnType)E_OK)
  {
    /* rollback case (OEUK)*/
    if (secLevel == FOTA_SECURITY_ROW_L10)
    {
      retVal = E_OK;
    }
    else
    {
      result = Fota_CompareVersionCallOut(newVer, lengthNewVer,
                                          currentVersion, lengthCurrent);
      /* This is HAE test code, Do not use this. */
      if ((FOTA_VERSION_CHECK_CALLOUT_GREATER == result) ||
        (FOTA_VERSION_CHECK_CALLOUT_EQUAL == result))
      {
        retVal = E_OK;
      }
      else
      {
        retVal = E_NOT_OK;
      }
    }
    if (E_OK == retVal)
    {
      /* version check rule                                                                      */
      /* You must check the version dependencies of all SwUnit                                   */
      /* Here, version dependency between SwUnits is checked.                                    */
    }
  }
  /* User should make own version check logic here. */
  return retVal;
}
#endif /* #if ((FOTA_SOFTWARE_VERSION_CHECK == STD_ON) && (FOTA_MCU_MEMORY_ACCESS_TYPE==FOTA_SINGLE_TYPE)) */

