YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
FUNC(void, FOTA_CODE) Fota_DestructiveResetSet(void)
{
	#if HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)
	Fota_DestructiveResetEnable = TRUE;
	#endif
}

#if HWRESOURCE_FAMILY(HWRESOURCE_SPC58XH)
FUNC(void, FOTA_CODE) Fota_DestructiveReset(void)
{
	if (Fota_DestructiveResetEnable == TRUE)
	{
		Mcu_RGM_PerformReset(MCU_DEST_RESET);
		Fota_DestructiveResetEnable = FALSE;
	}
	else
	{
		Mcu_LLD_PerformReset();
	}
}
#endif

FUNC(Fota_JobResultType_CallOut, FOTA_CODE) Fota_SecureBootMacUpdate(void)
{
	Fota_JobResultType_CallOut jobResult = FOTA_JOB_FAILED_CALL_OUT;
	/* Hae HSM Use Case */
#if (FOTA_STD_ON == FOTA_SF20_ENABLE)

#if (HWRESOURCE_VENDOR(HWRESOURCE_NXP))
	  jobResult=Fota_S32k3_SecureBootProcess();

#else


	HSM_SECURITY_INFO_t rst_HsmSecInfo;
	HSM_VERSION_CTX_t   rst_HsmVerInfo;
	uint32              rul_HsmVer;

	FOTA_MEMSET(&rst_HsmSecInfo, 0, sizeof(rst_HsmSecInfo));
	FOTA_MEMSET(&rst_HsmVerInfo, 0, sizeof(rst_HsmVerInfo));

	if((HSM_GetAllSecurityInfo(&rst_HsmSecInfo)==E_OK) &&
	   (HSM_GetVersionInfo(&rst_HsmVerInfo)==E_OK))
	{

		/* SecureBoot Not Enabled */
		if((rst_HsmSecInfo.secureBootState == HSM_SECUREBOOT_DISABLE) ||
		   (rst_HsmSecInfo.secureBootState == HSM_SECUREBOOT_NOT_PERFORMED))
		{
			jobResult = FOTA_JOB_OK_CALL_OUT;
		}
		else /* SecureBoot Enabled */
		{
			rul_HsmVer = (uint32)FOTA_ZERO;
			rul_HsmVer|= (uint32)(rst_HsmVerInfo.hsmMajorVersion)<<16;
			rul_HsmVer|= (uint32)(rst_HsmVerInfo.hsmMinorVersion)<<8;
			rul_HsmVer|= (uint32)(rst_HsmVerInfo.hsmPatchVersion);

 		    if(rul_HsmVer>=FOTA_SUP_HSM_VER)
			{
 				/*****************************************/
 				/* User Should fill Mac Update code here */
 	            /* Mac Update OK : retVal = E_OK         */
 	            /* Mac Update NG : retVal = E_NOT_OK     */
 	            /*****************************************/










 		    	/*****************************************/
			}
 		    else /* in case of Not Support Version, It should return E_NOT_OK for fail of activation */
 		    {
 		    	jobResult = FOTA_JOB_FAILED_CALL_OUT;
 		    }
		}
	}
	else /* HSM is not working */
	{
		jobResult = FOTA_JOB_FAILED_CALL_OUT;
	}

#endif
#endif
	return jobResult;
}

#if ((MEM_76_PFLS_DISABLE_ECC_TRAP == STD_OFF) && \
     ((MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC39X) || \
     (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC38X) || \
     (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC37X) || \
     (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC35X) || \
     (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC36X) || \
     (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC33X)))

#include "IfxCpu_reg.h"

#define FOTA_MCU_PASSWORDMASK                                          (uint16)0x003F
#define FOTA_MCU_SCUWDTCPUCON0_ENDINIT_OFF                                       (0u)
#define FOTA_MCU_SCUWDTCPUCON0_LCK_OFF                                           (1u)
#define FOTA_MCU_SCUWDTCPUCON0_PW_OFF                                            (2u)
#define FOTA_MCU_SCUWDTCPUCON0_REL_OFF                                          (16u)
#define FOTA_MCU_ONE                                                             (1U)
#define FOTA_MCU_ZERO                                                            (0U)

FUNC(void, DualM_CODE) Fota_Mcu_WdtClearCpuEndinit(void)
{
  uint16 ruw_Passwd;
  /* Fetch the password from the register */
  ruw_Passwd  = SCU_WDTCPU0_CON0.B.PW;
  /* Mask the password */
  ruw_Passwd ^= FOTA_MCU_PASSWORDMASK;

  if (FOTA_MCU_ZERO != SCU_WDTCPU0_CON0.B.LCK)
  {
    /* Password Access Bit Pattern operation */
    SCU_WDTCPU0_CON0.U = (uint32)((uint32)(FOTA_MCU_ONE << FOTA_MCU_SCUWDTCPUCON0_ENDINIT_OFF) |
                        (uint32)(FOTA_MCU_ZERO << FOTA_MCU_SCUWDTCPUCON0_LCK_OFF) |
                        (uint32)(ruw_Passwd << FOTA_MCU_SCUWDTCPUCON0_PW_OFF) |
                        (uint32)(SCU_WDTCPU0_CON0.B.REL << FOTA_MCU_SCUWDTCPUCON0_REL_OFF));
  }

  /* Clear ENDINT and set LCK bit in Config_0 register */
  SCU_WDTCPU0_CON0.U = (uint32)((uint32)(FOTA_MCU_ZERO << FOTA_MCU_SCUWDTCPUCON0_ENDINIT_OFF) |
                     (uint32)(FOTA_MCU_ONE << FOTA_MCU_SCUWDTCPUCON0_LCK_OFF) |
                     (uint32)(ruw_Passwd << FOTA_MCU_SCUWDTCPUCON0_PW_OFF) |
                     (uint32)(SCU_WDTCPU0_CON0.B.REL << FOTA_MCU_SCUWDTCPUCON0_REL_OFF));

  /* Read back ENDINIT and wait until it has been cleared */
  while (FOTA_MCU_ONE == SCU_WDTCPU0_CON0.B.ENDINIT){}
}

FUNC(void, DualM_CODE) Fota_Mcu_WdtSetCpuEndinit(void)
{
  uint16 ruw_Passwd;
  /* Fetch the password from the register */
  ruw_Passwd  = SCU_WDTCPU0_CON0.B.PW;
  /* Mask the password */
  ruw_Passwd ^= FOTA_MCU_PASSWORDMASK;

  if (FOTA_MCU_ZERO != SCU_WDTCPU0_CON0.B.LCK)
  {
    /* Password Access Bit Pattern operation */
    SCU_WDTCPU0_CON0.U = (uint32)((uint32)(FOTA_MCU_ONE << FOTA_MCU_SCUWDTCPUCON0_ENDINIT_OFF) |
                        (uint32)(FOTA_MCU_ZERO << FOTA_MCU_SCUWDTCPUCON0_LCK_OFF) |
                        (uint32)(ruw_Passwd << FOTA_MCU_SCUWDTCPUCON0_PW_OFF) |
                        (uint32)(SCU_WDTCPU0_CON0.B.REL << FOTA_MCU_SCUWDTCPUCON0_REL_OFF));
  }

  /* Set ENDINT and set LCK bit in Config_0 register */
  SCU_WDTCPU0_CON0.U = (uint32)((uint32)(FOTA_MCU_ONE << FOTA_MCU_SCUWDTCPUCON0_ENDINIT_OFF) |
                     (uint32)(FOTA_MCU_ONE << FOTA_MCU_SCUWDTCPUCON0_LCK_OFF) |
                     (uint32)(ruw_Passwd << FOTA_MCU_SCUWDTCPUCON0_PW_OFF) |
                     (uint32)(SCU_WDTCPU0_CON0.B.REL << FOTA_MCU_SCUWDTCPUCON0_REL_OFF));

  /* Read back ENDINIT and wait until it has been set */
  while (FOTA_MCU_ZERO == SCU_WDTCPU0_CON0.B.ENDINIT){}
}
#endif

FUNC(void, FOTA_CODE) Fota_BeforeFlashReadFunc(void)
{
#if (MEM_76_PFLS_DISABLE_ECC_TRAP == STD_OFF)

#if((MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC39X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC38X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC37X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC35X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC36X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC33X))
uint32 eccControlValue;

