YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
Fota_Mcu_WdtClearCpuEndinit(); 

#if(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC39X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU2_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU2_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU3_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU3_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU4_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU4_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU5_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU5_FLASHCON1.U = eccControlValue;
#elif(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC38X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU2_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU2_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU3_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU3_FLASHCON1.U = eccControlValue;
#elif((MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC37X) || \
      (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC35X))
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU2_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU2_FLASHCON1.U = eccControlValue;
#elif(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC36X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
#elif(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC33X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_DIS);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
#endif /* #if(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC3XX) */

Fota_Mcu_WdtSetCpuEndinit();

#endif /* #if(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC3XX) */

#endif /* #if (MEM_76_PFLS_DISABLE_ECC_TRAP == STD_OFF) */
}

FUNC(void, FOTA_CODE) Fota_AfterFlashReadFunc(void)
{
#if (MEM_76_PFLS_DISABLE_ECC_TRAP == STD_OFF)

#if((MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC39X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC38X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC37X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC35X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC36X) || \
   (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC33X))
uint32 eccControlValue;

Fota_Mcu_WdtClearCpuEndinit(); 

#if(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC39X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU2_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU2_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU3_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU3_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU4_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU4_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU5_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU5_FLASHCON1.U = eccControlValue;
#elif(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC38X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU2_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU2_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU3_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU3_FLASHCON1.U = eccControlValue;
#elif((MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC37X) || \
      (MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC35X))
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU2_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU2_FLASHCON1.U = eccControlValue;
#elif(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC36X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
eccControlValue = (MEM_76_PFLS_CPU1_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU1_FLASHCON1.U = eccControlValue;
#elif(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC33X)
eccControlValue = (MEM_76_PFLS_CPU0_FLASHCON1.U & MEM_76_PFLS_MASKUECC_CLR);
eccControlValue = (eccControlValue | MEM_76_PFLS_MASKUECC_EN);
MEM_76_PFLS_CPU0_FLASHCON1.U = eccControlValue;
#endif /* #if(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC3XX) */

Fota_Mcu_WdtSetCpuEndinit();

#endif /* #if(MEM_76_PFLS_SUPPORT_MCU == MEM_76_PFLS_MCU_TC3XX) */

#endif /* #if (MEM_76_PFLS_DISABLE_ECC_TRAP == STD_OFF) */
}

/* polyspace-begin MISRA-C3:2.7,8.13 [Justified:Low] "Not a defect" */

