YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Integration_Code/integration_Fota_F/usercode/Fota_User_Callouts.c
FUNC (Std_ReturnType, FOTA_CODE) Fota_ProcessReadActiveArea_UserCallout
(
  VAR(uint16, AUTOMATIC) InEcuSwUnit,
  VAR(uint8, AUTOMATIC) OpStatus,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpOut_MemoryArea,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpErrorCode
)
{
	/* if It is not used, LddRetVal should be E_NOT_OK */
  *LpErrorCode = DCM_E_REQUESTOUTOFRANGE;
  return (E_NOT_OK);

}

FUNC (Std_ReturnType, FOTA_CODE) Fota_ProcessActivate_UserCallout
(
  VAR(uint8, AUTOMATIC) InMemArea,
  VAR(uint16, AUTOMATIC) InEcuSwUnit,
  VAR(uint8, AUTOMATIC) OpStatus,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpErrorCode
)
{
	/* if It is not used, LddRetVal should be E_OK */
  *LpErrorCode = DCM_E_REQUESTOUTOFRANGE;
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_ProcessEraseTargetArea_UserCallout
(
  VAR(uint8, AUTOMATIC) InMemArea,
  VAR(uint16, AUTOMATIC) InEcuSwUnit,
  VAR(uint8, AUTOMATIC) OpStatus,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpOut_MemoryArea,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpErrorCode
)
{
	/* if It is not used, LddRetVal should be E_NOT_OK */
  *LpErrorCode = DCM_E_REQUESTOUTOFRANGE;
  return (E_NOT_OK);
}

FUNC(Std_ReturnType, FOTA_CODE) Fota_ProcessRequestDownload_UserCallout
(
  Dcm_OpStatusType OpStatus,
  uint8 DataFormatIdentifier,
  uint32 MemoryAddress,
  uint32 MemorySize,
  P2VAR(uint32, AUTOMATIC, FOTA_PRIVATE_DATA) LpBlockLength,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpErrorCode
)
{
	/* if It is not used, LddRetVal should be E_NOT_OK */
  *LpErrorCode = DCM_E_REQUESTOUTOFRANGE;
  return (E_NOT_OK);
}

FUNC(Dcm_ReturnWriteMemoryType, FOTA_CODE) Fota_ProcessTransferDataWrite_UserCallout
(
  Dcm_OpStatusType OpStatus,
  uint8 MemoryIdentifier /* Not Supported Argument */,
  uint32 MemoryAddress,
  uint32 MemoryWriteLen,
  P2CONST(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) pWriteData
)
{
	/* if It is not used, LddRetVal should be E_NOT_OK */
  return (E_NOT_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_ProcessRequestTransferExit_UserCallout
(
  Dcm_OpStatusType OpStatus,
  P2VAR(uint8, AUTOMATIC, DCM_APPL_DATA) LpMemoryData,
  uint32* LulParameterRecordSize,
  P2VAR(Dcm_NegativeResponseCodeType, AUTOMATIC, FOTA_PRIVATE_DATA)LpErrorCode
)
{
	/* if It is not used, LddRetVal should be E_NOT_OK */
  *LpErrorCode = DCM_E_REQUESTOUTOFRANGE;
  return (E_NOT_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_ProcessVerify_UserCallout
(
  VAR(uint8, AUTOMATIC) InMemArea,
  VAR(uint16, AUTOMATIC) InEcuSwUnit,
  VAR(uint8, AUTOMATIC) OpStatus,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpOut_MemoryArea,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) LpErrorCode
)
{
	/* if It is not used, LddRetVal should be E_NOT_OK */
  *LpErrorCode = DCM_E_REQUESTOUTOFRANGE;
  return (E_NOT_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fbl_SelectEntryPoint(
  P2VAR(uint32, AUTOMATIC, FOTA_PRIVATE_DATA) Lu32_EntryPointAddress)
{
  #if 0
  Std_ReturnType retVal = E_NOT_OK;
  *Lu32_EntryPointAddress = 0UL;
  #else
  Std_ReturnType retVal = E_OK;
  #endif
  /* user code */
  return (retVal);
}

/* Start Pfls user callout */
FUNC (void, FOTA_CODE) Fota_PflsInit_UserCallout
(
  P2VAR(boolean, AUTOMATIC, FOTA_PRIVATE_DATA) pPflsUserCalloutUse
)
{
	/* if It is not used, rub_PflsUserCalloutUse should be FALSE */
    *pPflsUserCalloutUse = FALSE;
}

FUNC (void, FOTA_CODE) Fota_PflsDeinit_UserCallout
(
  void
)
{
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsCancelReq_UserCallout
(
  VAR(uint32, AUTOMATIC) rul_MemoryInstance
)
{
	/* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(rul_MemoryInstance);
  return (E_OK);
}

FUNC(Std_ReturnType, FOTA_CODE) Fota_PflsEraseRequest_UserCallout
(
  VAR(uint32, AUTOMATIC) In_MemoryArea,
  VAR(uint32, AUTOMATIC) areaAddress,
  VAR(uint32, AUTOMATIC) eraseLen
)
{
	/* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(In_MemoryArea);
  FOTA_UNUSED(areaAddress);
  FOTA_UNUSED(eraseLen);
  return (E_OK);
}

FUNC(Std_ReturnType, FOTA_CODE) Fota_PflsWriteRequest_UserCallout
(
  VAR(uint32, AUTOMATIC) In_MemoryArea,
  VAR(uint32, AUTOMATIC) rul_WriteStartAddr,
  P2CONST(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) rup_Write_buff,
  VAR(uint32, AUTOMATIC) rul_write_size
)
{
	/* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(In_MemoryArea);
  FOTA_UNUSED(rul_WriteStartAddr);
  FOTA_UNUSED(rup_Write_buff);
  FOTA_UNUSED(rul_write_size);
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsReadRequest_UserCallout
(
  VAR(uint32, AUTOMATIC) In_MemoryArea,
  VAR(uint32, AUTOMATIC) rul_ReadStartAddr,
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) rup_Read_buff,
  VAR(uint32, AUTOMATIC) rul_read_size
)
{
	/* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(In_MemoryArea);
  FOTA_UNUSED(rul_ReadStartAddr);
  FOTA_UNUSED(rup_Read_buff);
  FOTA_UNUSED(rul_read_size);
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsSwapBankRequest_UserCallout
(
  void
)
{
  /* if It is not used, LddRetVal should be E_OK */
  return (E_OK);
}

FUNC (Mem_76_Pfls_JobResultType_CallOut, FOTA_CODE) Fota_PflsGetJobResult_UserCallout
(
  VAR(uint32, AUTOMATIC) In_MemoryArea
)
{
	Mem_76_Pfls_JobResultType_CallOut jobResult;
  /* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(In_MemoryArea);
  jobResult = MEM_JOB_OK_CALL_OUT;
  return (jobResult);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsGetActiveBank_UserCallout
(
  P2VAR(uint8, AUTOMATIC, FOTA_PRIVATE_DATA) pReadBank
)
{
  /* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(pReadBank);
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsGetCovAddr_UserCallout
(
  VAR(uint32, AUTOMATIC) rul_MemoryInstance,
  VAR(Fota_HwSpSvAddrType_CallOut ,AUTOMATIC) ren_Fota_HwSpSvAddrType,
  P2VAR(uint32, AUTOMATIC, FOTA_PRIVATE_DATA) rup_StdAddr,
  P2VAR(uint32, AUTOMATIC, FOTA_PRIVATE_DATA) rup_length
)
{
  /* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(rul_MemoryInstance);
  FOTA_UNUSED(ren_Fota_HwSpSvAddrType);
  FOTA_UNUSED(rup_StdAddr);
  FOTA_UNUSED(rup_length);
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsTgtAreaSet_UserCallout
(
  VAR(uint32, AUTOMATIC) rul_MemoryInstance,
  VAR(Fota_HwSpSvAddrType_CallOut, AUTOMATIC) rue_HwSpSvAddrType
)
{
  /* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(rul_MemoryInstance);
  FOTA_UNUSED(rue_HwSpSvAddrType);
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsGetFlashAlignment_UserCallout
(
  VAR(uint32, AUTOMATIC) rul_MemoryInstance,
  P2VAR(uint32, AUTOMATIC, FOTA_PRIVATE_DATA) rup_AlineVal
)
{
  /* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(rul_MemoryInstance);
  FOTA_UNUSED(rup_AlineVal);
  return (E_OK);
}

FUNC (Std_ReturnType, FOTA_CODE) Fota_PflsGetSectorSize_UserCallout
(
  VAR(uint32, AUTOMATIC) rul_MemoryInstance,
  P2VAR(uint32, AUTOMATIC, FOTA_PRIVATE_DATA) rup_AlineVal,
  VAR(uint32, AUTOMATIC) address
)
{
  /* if It is not used, LddRetVal should be E_OK */
  FOTA_UNUSED(rul_MemoryInstance);
  FOTA_UNUSED(rup_AlineVal);
  FOTA_UNUSED(address);
  return (E_OK);
}
/* End Pfls user callout */

/* polyspace-end MISRA-C3:2.7,8.13 [Justified:Low] "Not a defect" */
/* polyspace-end MISRA-C3:20.9 [Justified:Low] "Not a defect" */

#endif /* #ifndef FOTA_INTEGRATION_SINGLEMEM_PLATFORM */
/*******************************************************************************
**                             End of File                                    **
*******************************************************************************/
